{
  "backend/main.mo": "Main Motoko actor for the ANC Marketplace backend, defining core data types (UserProfile, Product, EcomOrder, Lesson, etc.) and including mixins for blob storage, authorization, Stripe, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (financial overview balance display, Stripe payout form, transaction history, Stripe Connect onboarding) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary catalog describing the purpose and key changes of each frontend source file across pages, hooks, components, and styles.",
  "frontend/index.html": "Root HTML entry point for the ANC Marketplace React app, including SEO meta tags, Open Graph/Twitter cards, PWA manifest link, favicon references, and the root div with main.tsx script.",
  "frontend/public/manifest.json": "PWA manifest for ANC Marketplace defining app name, icons at multiple resolutions, display mode, theme colors, and app categories for installability.",
  "frontend/public/policies/marketplace-policy.md": "Markdown document outlining the ANC Marketplace policy including user responsibilities, service fees ($5 per sale), payment processing, prohibited activities, and dispute resolution terms.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy document for ANC Electronics N More describing data collection practices, usage, sharing with third-party processors, user rights, and contact information.",
  "frontend/public/policies/returns-policy.md": "Defines the returns policy for ANC Electronics, covering eligibility, non-returnable items, return process, shipping costs, refund timelines, restocking fees, and contact information.",
  "frontend/public/policies/shipping-policy.md": "Outlines ANC Electronics' shipping policy including available methods, cost calculation, processing times, tracking, international shipping, and handling of lost or damaged packages.",
  "frontend/public/policies/terms-and-conditions.md": "Defines the terms and conditions for using ANC Marketplace, covering user eligibility, account rules, seller/buyer responsibilities, service fees, payment processing, liability limits, and dispute resolution.",
  "frontend/src/App.tsx": "Sets up the React application with TanStack Router and React Query, defining all client-side routes (pages for home, admin, seller, customer, policies, blogs, etc.) wrapped in a shared Layout component.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "An empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Admin panel that lists all registered users in a searchable, refreshable table showing profile, role badge, balance, and join date.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "A card component that displays and allows copying/opening the app URL, admin sign-in URL, and owner email address for administrative reference.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "A layout wrapper for admin console pages that renders a titled header and wraps children in a styled card container.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "A dropdown menu component with grouped admin action items (user management, marketplace oversight, financial reports, system settings) that currently show 'coming soon' toasts on click.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Presentational component that renders a grid of metric cards (revenue, sales, pending/failed payments, total transactions) from AdminCenterAnalytics data.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Fetches admin analytics data and renders SalesMetricsCards alongside detailed sales stats, with loading skeletons, error alerts, and a refresh button.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "UI form panel for recording manual and scheduled employee payments with tabbed layout; backend integration is noted as pending and actions only log to console.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Admin panel card for viewing and (stub) saving the per-sale marketplace service fee. The save button is permanently disabled pending backend integration.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays a 4-card financial overview grid showing available balance, total deposited (from transaction history), business credit, and payroll savings for the admin dashboard.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "An admin panel card that fetches and displays marketplace roadmap items with completion progress, supporting a refresh/update action via a mutation hook.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Placeholder admin messaging panel card that shows a 'Coming Soon' state with a feature list and a compose button that triggers a toast notification.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Form card for composing and sending a message to a marketplace participant, with recipient select, subject input, and body textarea fields.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a scrollable conversation thread between admin and a recipient, with avatar-aligned messages and an inline reply textarea.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Admin panel for initiating Stripe checkout sessions to collect marketplace sale fees and store builder subscription charges, with a Stripe configuration guard.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card for creating and managing a Stripe Connect account for the marketplace owner, handling account creation, onboarding link generation, status refresh, and disconnection via localStorage.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Admin panel component that displays a card containing Stripe setup and owner Stripe Connect configuration cards for managing marketplace payment processors.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Admin card component for configuring Stripe API keys; auto-configures with live keys on first load and allows manual key entry with visibility toggling.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel component that displays pending role applications in a table and allows admins to approve or reject them using mutation hooks, with toast notifications for feedback.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel that displays all transaction history and payout transactions in tabbed tables with status badges, currency formatting, and a refresh action.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Admin panel for initiating owner withdrawals via Stripe payout, showing available balance and a form to specify withdrawal amount, currency, and reason.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Displays a summary of user roles (admins, users, guests) as stat cards fetched via a query hook, with loading and error states.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat panel for the ANC Assistant supporting multiple modes (Customer, Seller, etc.) with text input, speech recognition, and text-to-speech capabilities.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating button widget that toggles the AssistantChatPanel open or closed in the bottom-right corner of the page.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Auth guard component that renders children only when the user is authenticated and has a profile, otherwise showing a login prompt or redirecting to profile setup.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with links to legal/policy pages, contact information, admin/employee access links, and payment method icons.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header containing navigation dropdowns, login/logout via Internet Identity, role-based redirect logic after authentication, and a Footer component.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file with no content.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file with no content.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file with no content.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed banner component that prompts users to accept or reject cookie usage, persisting their choice and linking to the privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog component that collects a new user's full name and email, saves their profile via a mutation hook, and redirects them to a role-appropriate dashboard.",
  "frontend/src/components/RequireRegisteredUser.tsx": "A wrapper component that checks if an authenticated user has a profile and redirects to the profile setup page if not, showing a loading spinner while the check is in progress.",
  "frontend/src/components/RouterErrorScreen.tsx": "A full-page error screen displayed on routing failures, offering buttons to refresh the page or navigate back to the home page.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "A React class-based error boundary that catches both render errors and unhandled promise rejections, displaying an error UI with technical details and a refresh button.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that verifies the user is human by requiring them to check a checkbox and answer a simple math question (7+3) before proceeding with payment.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the ordered list of seller onboarding step configurations (title, description, placeholder status) and provides helper functions to look up steps by ID or index.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step onboarding wizard for sellers that tracks progress, saves/restores state via backend hooks, and navigates through predefined onboarding steps with back/next controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays a placeholder UI for upcoming seller profile features, showing an icon, title, description, and an optional badge (defaulting to 'Coming Soon').",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays a single lesson's detail view including an optional embedded video iframe, HTML content, and buttons to mark the lesson complete or navigate back to the lessons list.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Provides a React context that combines microphone permission state and voice preferences (activation/spoken replies toggles), exposing them via a useVoiceSettings hook.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useAssistant.ts": "Provides a useMutation hook for asking the AI assistant a categorized question; currently returns a placeholder message since the backend method is not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP, exposing login/logout functions, identity state, and login status via a React context and useInternetIdentity hook.",
  "frontend/src/hooks/useMicrophonePermission.ts": "A hook that checks, requests, and tracks browser microphone permission status, supporting permission queries, user-gesture-triggered requests, and retry logic.",
  "frontend/src/hooks/usePageActivity.ts": "A hook that tracks whether the current browser tab/window is active by listening to visibility change, focus, and blur events, returning a boolean isActive state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend interactions including user profile management, admin checks, role applications, seller earnings, Stripe configuration, and transaction records. Many role application hooks are stubs that throw 'not yet implemented' errors.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Hook that reads the current user's active role and returns the appropriate dashboard redirect path based on their role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides hooks to fetch seller onboarding progress from the backend and save it; the save mutation is a stub that throws 'not yet implemented'.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Hook wrapping the Web Speech API to manage speech recognition state including start/stop controls, interim and final transcripts, error handling, and optional auto-restart on end.",
  "frontend/src/hooks/useStripeCheckout.ts": "Mutation hook that calls the backend actor to create a Stripe checkout session for a list of shopping items and redirects the browser to the resulting Stripe URL.",
  "frontend/src/hooks/useStripeConnect.ts": "Provides mutation hooks for Stripe Connect operations: creating an Express connected account, generating an account onboarding link, and retrieving an existing connected account via direct Stripe API calls.",
  "frontend/src/hooks/useStripePayout.ts": "Mutation hook that initiates a Stripe payout via direct API call and records the resulting transaction in the backend actor, then invalidates related query caches.",
  "frontend/src/hooks/useTextToSpeech.ts": "Hook wrapping the browser's SpeechSynthesis API to expose speak, stop, and cancel controls along with speaking state and the currently spoken message ID.",
  "frontend/src/hooks/useVoicePreferences.ts": "Hook that reads and writes voice preferences (voice activation and spoken replies toggles) to localStorage, exposing helpers to update individual preference fields.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, OKLCH-based CSS custom properties for a navy-blue theme, menu surface component classes, an animated gradient logo text effect, and a voice listening pulse animation.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions to get, set, and check cookie consent status stored as a boolean string in localStorage under a fixed key.",
  "frontend/src/lib/humanCheck.ts": "Utility functions to store, retrieve, and clear a human-verification flag in sessionStorage with a 30-minute TTL, used to gate bot-check flows.",
  "frontend/src/lib/policies.ts": "Defines TypeScript types and metadata for site policies (privacy, shipping, returns, terms, marketplace), including display names, routes, versions, and last-updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Exports pricing constants and copy strings for the marketplace ($5/sale fee) and optional Store Builder subscription ($10/month), including FAQ text and UI headlines.",
  "frontend/src/lib/stripeConfig.ts": "Centralizes Stripe publishable and secret API keys along with TypeScript interfaces for Stripe connected accounts, account links, and payouts; includes a security warning about exposing the secret key in frontend code.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection and factory functions for the Web Speech API, including creating a SpeechRecognition instance and a TTS controller for speech synthesis.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages persistent voice preference settings (voice activation and spoken replies) in localStorage, with versioned read/write helpers and defaults.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AccountPortalPage.tsx": "Renders an authenticated account portal page showing user profile info (name, email, creation date, role) and navigation cards for settings, billing, and documents.",
  "frontend/src/pages/AdminCenterPage.tsx": "Full-featured admin center page with tabbed panels for financial overview, payments, fees, transactions, employees, transfers, user roles, roadmap, messaging, and analytics, with actor timeout and auto-retry error handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that initializes access control on mount, guards against unauthenticated access, and renders tabbed admin panels for financial state and platform management.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard page displaying cards for referral links, commission tracking, performance analytics, and marketing resources, along with a commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "Displays a categorized app marketplace (Store Builder, Marketing, Fulfillment, Analytics) with available and coming-soon apps. Requires authenticated users and renders app cards with color-coded icons and badges.",
  "frontend/src/pages/AppLaunchPage.tsx": "Shows a detail/launch page for a specific app identified by URL param, with options to launch, configure, or uninstall. Includes static config data for known apps like ClickFunnels and Dropshipping Partners.",
  "frontend/src/pages/ApplyPage.tsx": "Allows authenticated users to apply for an Employee or Admin role by selecting a role and submitting a reason. Submits the application via a mutation hook and redirects home on success.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Renders a B2B business dashboard with four feature cards (B2B Services, Business Credit, Team Management, Analytics) and a placeholder business overview section. Requires authenticated user and displays a personalized welcome message.",
  "frontend/src/pages/CustomerBlog.tsx": "Displays a grid of static customer-facing blog post cards covering topics like getting started, security, and subscriptions. Each card shows category, read time, excerpt, and a read-more button.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders a single customer-facing blog post by looking up a hardcoded `postId` param in a local record of posts, displaying title, date, category, read time, and paragraph content inside a card layout.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays the authenticated customer's dashboard with four navigation cards (Purchase History, Wishlist, Messages, Settings) and a recent activity placeholder, wrapped in an auth guard component.",
  "frontend/src/pages/CustomerFAQ.tsx": "Renders a customer FAQ page with an accordion list of common questions/answers about the platform, pricing, payments, and support, pulling some copy from a shared `pricingCopy` library.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Shows a customer messages/inbox page that requires login via Internet Identity; currently displays a 'coming soon' placeholder indicating inbox-style messaging is not yet implemented.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Displays a purchase history and order tracking page for authenticated customers; currently shows a 'coming soon' placeholder until the marketplace order system is implemented.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides an authenticated customer settings page with voice and microphone permission controls, allowing users to toggle voice activation and spoken replies using the VoiceSettingsContext.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Renders a protected employee dashboard with four feature cards (Assigned Tasks, Schedule, Payroll, Resources) and a Recent Updates section, fetching the user's profile for a personalized greeting.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/HomePage.tsx": "Displays the ANC Marketplace landing page with a hero section, three feature cards (E-Commerce, Startup Program, B2B Services), and a pricing section using navigation links.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page rendering the ANC Marketplace policy document covering seller responsibilities, buyer protection, fees, prohibited items, and dispute resolution.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure confirmation page within the AdminConsoleLayout, listing common failure reasons and providing buttons to return to the admin center or retry.",
  "frontend/src/pages/PaymentSuccess.tsx": "Displays a payment success confirmation page within the AdminConsoleLayout, with buttons to return to the admin center or navigate to the transactions tab.",
  "frontend/src/pages/PciCompliancePage.tsx": "Shows ANC Electronics' PCI DSS compliance certificate with options to view or download it, along with explanatory text about what the certification means for customers.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page rendering the ANC Marketplace privacy policy covering data collection, usage, sharing, security, and user rights.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Thin wrapper page that renders the ProfileSetup component.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page that allows users to select a role (seller, customer, business, or marketer), authenticate via Internet Identity, and save their profile. Redirects to the appropriate role-based dashboard upon successful registration.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static page displaying the ANC Marketplace returns policy, including eligibility, non-returnable items, return process, refund processing, and shipping responsibilities.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Seller dashboard page that displays earnings summary metrics (revenue, orders, shipments) filtered by a selectable time frame, with loading and error states, wrapped in an authenticated user guard.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Thin wrapper page that renders the SellerOnboardingWizard component inside a RequireAuthenticatedRegisteredUser guard.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/SellerProfilePage.tsx": "Seller profile page displaying a grid of placeholder cards for upcoming features (store branding, account details, dashboard customization, integrations, store settings, support), each marked as 'Coming Soon'.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Blog listing page for sellers and businesses, rendering a grid of hardcoded blog post cards with title, excerpt, category, date, and read time, with navigation to individual post pages.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Individual blog post detail page that looks up a post by route param ID from a hardcoded record of posts and renders the full content with metadata, with a back-navigation button.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Renders a FAQ page for B2B sellers using an accordion layout, covering topics like B2B features, subscriptions, Store Builder, funnels, dropshipping, payments, and support.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Displays a static shipping policy page covering shipping methods, costs, processing time, international shipping, and contact information.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content; likely a placeholder for a startup dashboard page.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content; likely a placeholder for the Store Builder page.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content; likely a placeholder for the Store page.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays a static Terms & Conditions page covering acceptance of terms, account responsibilities, payments, intellectual property, and liability limitations.",
  "frontend/src/types/index.ts": "Defines all shared frontend TypeScript types and interfaces including user roles, products, orders, B2B services, store builder config, dropshipping partners, app integrations, and various discriminated union variants.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript type declarations for the Web Speech API (SpeechRecognition and related interfaces) which are not included in the standard TypeScript lib.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom theme tokens (colors using oklch, border radius, box shadows, keyframes) and enables plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state for the ANC Marketplace app, documenting existing features, architectural decisions (Stripe Connect direct frontend integration), known issues, and versioning metadata."
}