{
  "backend/main.mo": "Main Motoko actor for the ANC Marketplace backend, defining core data types (UserProfile, Product, EcomOrder, Lesson, etc.) and integrating modules for access control, Stripe payments, HTTP outcalls, and blob storage.",
  "feature_evidence.json": "Feature evidence report mapping three financial display requirements (gross deposit amount, net available balance, and payroll savings ledger entry) to their implementing frontend files and component dependencies.",
  "frontend-file-summaries.txt": "Auto-generated summary index describing the purpose and key details of each frontend source file across pages, components, and hooks in the ANC Marketplace React application.",
  "frontend/index.html": "Root HTML entry point for the ANC Marketplace React app, including SEO meta tags, Open Graph/Twitter cards, PWA manifest link, favicon references, and the root div with main.tsx script.",
  "frontend/public/manifest.json": "PWA manifest for ANC Marketplace defining app name, theme colors, icon sizes, display mode, and screenshot metadata for installable web app support.",
  "frontend/public/policies/marketplace-policy.md": "Markdown document outlining the ANC Marketplace platform policy including user responsibilities, service fees ($5 per sale), payment processing, prohibited activities, and dispute resolution terms.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy document for ANC Electronics N More/ANC Marketplace detailing data collection practices, usage, sharing with third parties, user rights, and contact information.",
  "frontend/public/policies/returns-policy.md": "Defines the returns policy for ANC Electronics, covering eligibility, non-returnable items, return process, refund timelines, restocking fees, and contact information.",
  "frontend/public/policies/shipping-policy.md": "Outlines shipping methods, costs, processing times, tracking, international shipping rules, and procedures for lost or damaged packages for ANC Electronics.",
  "frontend/public/policies/terms-and-conditions.md": "Legal terms governing use of ANC Marketplace, including account rules, seller/buyer responsibilities, service fees, payment processing, liability limits, and dispute resolution.",
  "frontend/src/App.tsx": "Defines the React application's routing tree using TanStack Router, registering all page routes under a shared Layout root, and wraps the app with QueryClient and InternetIdentity providers.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "An empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Admin panel that lists all registered user accounts in a searchable, refreshable table with role badges, balance, and join date details.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "A card component that displays the app URL, admin sign-in URL, and owner email with copy-to-clipboard and open-in-new-tab actions.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "A layout wrapper for admin pages that renders a styled container with a title, optional subtitle, and a card-style content area.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "A dropdown menu component providing grouped admin action items (user management, marketplace oversight, financials, system) that currently show 'coming soon' toasts on click.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Presentational component that renders a grid of metric cards (revenue, sales, pending/failed payments, total transactions) from admin analytics data.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Admin analytics panel that fetches and displays sales performance metrics using SalesMetricsCards, with loading, error, and refresh states.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Admin UI for viewing, searching, and inline-editing Q&A entries in the AI assistant's knowledge base.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Admin card component that fetches and displays a list of questions the assistant could not answer, showing each question's category suggestion and interaction count with a refresh button.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Admin panel with tabbed UI for logging manual and scheduled employee payments; backend integration is pending and all operations are currently simulated.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Admin card for viewing and (stub) saving the per-sale marketplace service fee; the input and save button are disabled pending backend integration.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays four financial summary cards (available balance, payroll savings, credit limit, credit used) using hardcoded correct cent values and optional live data from AdminFinancialState, with loading skeletons.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "An admin card component that fetches and displays marketplace roadmap items with progress tracking, and supports refreshing the data via a mutation.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Placeholder admin messaging panel that shows a 'Coming Soon' state with a feature list; the compose button triggers a toast notification instead of opening a real composer.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Form card component for composing a new admin message with recipient (select), subject, and body fields; calls onSend and onClose callbacks on submission.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a scrollable conversation thread between the admin and a recipient, with an inline reply textarea that calls onReply on submission.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Admin panel card for collecting marketplace revenue via Stripe, offering buttons to charge a per-sale service fee or a store builder subscription by creating Stripe checkout sessions.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card component for managing the owner's Stripe Connect account, supporting account creation, onboarding link generation, and status refresh with localStorage persistence of the account ID.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel that renders the Stripe setup card and the owner Stripe Connect card together under a 'Payment Processors' heading.",
  "frontend/src/components/admin/payments/PaymentsPanel.tsx": "Admin payments panel with a form for submitting outbound payments (Stripe payout, employee, partner, supplier, bill pay) and a local transaction history list stored in localStorage.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Card for configuring Stripe API credentials, auto-configuring with pre-set live keys on first load and allowing manual key entry with a toggle to show/hide the secret key.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel component that displays pending role applications in a table, allowing admins to approve or reject applicants using their Principal identifiers.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying transaction history and payout transactions in tabbed tables, with status/type badges, currency formatting, and a hardcoded internal payroll savings ledger entry injected into the list.",
  "frontend/src/components/admin/transfers/TransferPanel.tsx": "Admin panel component for initiating financial transfers between sources (available balance, credit, payroll) and destinations (platform user, credit payback, payroll savings), with a local transfer history log stored in localStorage.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Empty stub file with no content, likely a placeholder for a future transfers panel component.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin component that fetches and displays a summary of user roles (admins, users, guests) as stat cards with counts.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat panel component for an AI assistant supporting multiple modes (Customer, Seller, Website/App Builder, Business Operations) with speech recognition, text-to-speech, and voice activation features.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget button that toggles the AssistantChatPanel open and closed, fixed to the bottom-right corner of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Auth guard component that checks Internet Identity authentication and user profile existence, redirecting unauthenticated users to login and profileless users to profile setup before rendering children.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with links to legal policies, contact information, access links for admin/employee portals, and payment method icons.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a sticky header containing navigation dropdowns and a login/logout button using Internet Identity, plus role-based redirect logic and a shared Footer.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file, likely a placeholder for a policy document display component.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file, likely a placeholder for a panel displaying policy signature records.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file, likely a placeholder for a guard component requiring policy signatures before rendering children.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed bottom banner component that prompts users to accept or reject cookie usage, persisting their choice via a cookieConsent utility and linking to the privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog component that collects a new user's full name and email, saves their profile via a mutation hook, and redirects them to a role-appropriate dashboard.",
  "frontend/src/components/RequireRegisteredUser.tsx": "A route guard component that checks if an authenticated user has a profile and redirects to the profile setup page if not, showing a loading spinner in the interim.",
  "frontend/src/components/RouterErrorScreen.tsx": "A full-page error UI displayed when a route fails to load, offering buttons to refresh the page or navigate home.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "A React class-based error boundary that catches both render errors and unhandled promise rejections, displaying an error screen with technical details and a refresh button.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Modal dialog that verifies the user is human via a checkbox confirmation and a simple math challenge (7+3) before allowing a payment action to proceed.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the ordered list of seller onboarding step configurations (id, title, description, placeholder flag) and helper functions to look up steps by their SellerOnboardingStep enum value.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "Multi-step seller onboarding wizard that tracks progress, saves state to the backend, and navigates through onboarding steps with back/next controls and a progress bar.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "Reusable card component displaying a placeholder feature with an icon, title, description, and an optional badge (defaulting to 'Coming Soon') for seller profile sections not yet implemented.",
  "frontend/src/components/startup/Activities.tsx": "Empty file, likely a placeholder for a startup activities component.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file, likely a placeholder for a startup business credit component.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file, likely a placeholder for a startup classes and lessons component.",
  "frontend/src/components/startup/LessonDetail.tsx": "Renders a detailed view of a single lesson, including an optional embedded video, HTML content, and buttons to mark as complete or navigate back.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content or exports.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Provides a React context combining microphone permission state and voice preferences, exposing them via a `useVoiceSettings` hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Exposes a `useAskAssistant` mutation hook that currently returns a placeholder message since the backend AI assistant method is not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via `AuthClient`, providing login, logout, and identity state through a React context and `useInternetIdentity` hook.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Manages browser microphone permission state, providing functions to request and retry permission and tracking whether the feature is supported.",
  "frontend/src/hooks/usePageActivity.ts": "Tracks whether the page is currently active/focused by listening to visibility change and focus/blur events, returning a boolean state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend interactions including user profiles, access control, role applications, and admin/seller data, with several methods stubbed pending backend implementation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Returns a redirect path based on the authenticated user's active role, mapping each role to its corresponding dashboard route.",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks to fetch and save seller onboarding progress, with the save mutation currently throwing a not-implemented error.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the browser Web Speech API to provide start/stop controls, transcript state, and error handling with optional continuous/restart modes gated on microphone permission.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a React Query mutation hook that creates a Stripe checkout session via the backend actor and redirects the user to the Stripe-hosted payment URL.",
  "frontend/src/hooks/useStripeConnect.ts": "Provides React Query mutation hooks for creating Stripe Connect express accounts, generating account onboarding links, and retrieving connected account details via direct Stripe API calls.",
  "frontend/src/hooks/useStripePayout.ts": "Provides a React Query mutation hook that initiates a Stripe payout via direct API call and records the transaction in the backend actor, invalidating related queries on success.",
  "frontend/src/hooks/useTextToSpeech.ts": "React hook that wraps a TTS controller to expose speak, stop, and cancel functions along with speaking state and the currently spoken message ID.",
  "frontend/src/hooks/useVoicePreferences.ts": "React hook that reads and writes voice preference settings (voice activation and spoken replies) to localStorage, exposing typed update helpers.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/components/utilities, a navy-blue OKLCH design token system, menu surface styles, animated logo gradient, and voice listening indicator animation.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions to get, set, and check cookie consent status stored as a boolean string in localStorage.",
  "frontend/src/lib/humanCheck.ts": "Utility functions to store, retrieve, and clear a session-scoped human verification flag in sessionStorage with a 30-minute TTL.",
  "frontend/src/lib/policies.ts": "Defines TypeScript types and a metadata registry for the five site policies (privacy, shipping, returns, terms, marketplace), including display names, routes, and version info.",
  "frontend/src/lib/pricingCopy.ts": "Exports structured pricing constants and copy strings for the marketplace ($5/sale fee) and optional Store Builder ($10/month) subscription tiers.",
  "frontend/src/lib/stripeConfig.ts": "Centralizes Stripe configuration including publishable key, secret key, Connect account ID, and shared TypeScript interfaces for Stripe account, account link, and payout objects.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature-detection helpers and factory functions for the Web Speech Recognition API and a SpeechSynthesis TTS controller abstraction.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages versioned voice preference settings (voice activation, spoken replies) in localStorage with get/set utility functions and defaults.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays an authenticated user's account portal with profile overview, navigation cards for settings, billing, and documents. Shows loading skeletons while fetching user profile data.",
  "frontend/src/pages/AdminCenterPage.tsx": "Full-featured admin center page with tabbed navigation covering financial overview, transactions, accounts, analytics, fees, employee payments, messaging, and knowledge base. Auto-initializes access control on mount and handles retry logic for initialization errors.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that wraps multiple admin panels (financial, payments, fees, transactions, employees, transfers) in a tabbed layout within AdminConsoleLayout. Redirects unauthenticated users and displays roadmap item status badges.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing cards for referral links, commission tracking, performance analytics, and marketing resources. Requires authenticated registered user and displays a commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "App center page listing categorized third-party and platform apps (store builder, marketing, fulfillment, analytics) with available/coming-soon status badges. Requires authentication and renders app cards with color-coded category icons.",
  "frontend/src/pages/AppLaunchPage.tsx": "A page that displays details and actions (launch, configure, uninstall) for a specific app identified by URL param, with hardcoded configs for ClickFunnels, Dropshipping Partners, and Template Selector. Requires authenticated registered user.",
  "frontend/src/pages/ApplyPage.tsx": "A role application page where authenticated users can select either Employee or Admin role and submit a reason; submission is stubbed with a timeout and toast notification.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "A business dashboard page for authenticated users showing four feature cards (B2B Services, Business Credit, Team Management, Analytics) and a placeholder business overview section.",
  "frontend/src/pages/CustomerBlog.tsx": "Displays a grid of hardcoded customer blog post previews with category badges, dates, and read times, with navigation to individual post pages.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders the full content of a specific blog post looked up by postId URL param from a hardcoded record of posts, with a back button to the blog listing.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Renders the customer dashboard with four navigation cards (Purchase History, Wishlist, Messages, Settings) and a Recent Activity section, wrapped in an authentication guard.",
  "frontend/src/pages/CustomerFAQ.tsx": "Displays a customer-facing FAQ page with an accordion of common questions about ANC Electronics N Services, including pricing, payments, and account setup.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Shows a placeholder inbox page for customer-to-seller messaging, displaying a 'Coming Soon' notice and requiring the user to be logged in via Internet Identity.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Displays a placeholder purchase history and order tracking page with a 'Coming Soon' notice, requiring the user to be authenticated.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides a settings page where authenticated customers can manage voice preferences (voice activation, spoken replies) and microphone permissions, with status indicators for browser support.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Renders the employee dashboard with four cards (Assigned Tasks, Schedule, Payroll, Resources) and a Recent Updates section, wrapped in an authentication guard.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/HomePage.tsx": "Landing page for ANC Marketplace displaying a hero section with logo and CTA, and a grid of three feature cards (E-Commerce, Startup Program, B2B Services) with navigation links and pricing info.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page rendering the ANC Marketplace policy document covering seller responsibilities, buyer protection, fees, prohibited items, and dispute resolution.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page that displays an error card with common failure reasons and buttons to return to the admin center or retry.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that shows a success card with links to return to the admin center or navigate to the transactions tab.",
  "frontend/src/pages/PciCompliancePage.tsx": "Page displaying ANC's PCI DSS compliance certificate with options to view it in a new tab or download it, along with a description of what the certification means for users.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page rendering ANC's privacy policy covering data collection, usage, sharing, security, and user rights.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Thin wrapper page that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page where users select a role (Seller, Customer, Business, or Affiliate Marketer), authenticate via Internet Identity, and submit their name and email to create a profile.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static page rendering ANC's returns policy covering eligibility, non-returnable items, the return process, refund timelines, and shipping responsibilities.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays a seller dashboard with earnings, shipping costs, and order count summary cards, filterable by time frame (today, week, month, all time). Wraps content in a RequireAuthenticatedRegisteredUser guard with placeholder static data.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Page wrapper that renders the SellerOnboardingWizard component inside a RequireAuthenticatedRegisteredUser auth guard.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/SellerProfilePage.tsx": "Renders a seller profile page with a grid of placeholder cards for upcoming features (store branding, account details, dashboard customization, integrations, store settings, support) all marked as 'Coming Soon'.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a blog listing page for sellers and businesses with six hardcoded blog post cards covering topics like B2B dashboards, startup programs, and sales funnels, each navigable to a detail page.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post detail pages by looking up a postId route param against a hardcoded record of post content, displaying title, date, category, and paragraph-based content.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays a FAQ page for sellers and businesses using an accordion component with 12 hardcoded questions covering B2B features, subscriptions, integrations, payments, and support.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying the site's shipping policy with sections on shipping methods, costs, processing time, international shipping, and contact information.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying the site's terms and conditions with sections on acceptance, service use, account responsibilities, payments, intellectual property, liability, and contact info.",
  "frontend/src/types/index.ts": "Defines all frontend TypeScript types and interfaces including UserRole, UserProfile, Product, EcomOrder, Lesson, VirtualMeeting, B2BService, StoreBuilder config, and various discriminated union variant types used across the application.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript ambient type declarations for the Web Speech API (SpeechRecognition, SpeechRecognitionEvent, etc.) and extends the Window interface to include both standard and webkit-prefixed SpeechRecognition constructors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, border radius, box shadow variants, and animation keyframes, with plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current project state for a Marketplace/financial dashboard app, recording existing features and a pending fix request to correct transaction history display: gross deposit of $77,957.38, payroll savings deduction of $4,276.22, and net balance of $73,681.16 with a ledger entry."
}