{
  "backend/main.mo": "Main actor defining all types (SellerOnboardingProgress, PolicySignatureRecord, UserProfile, UserRole, Product, EcomOrder, Lesson, VirtualMeeting, etc.) and implementing business logic for user management, role applications, products, orders, payments, Stripe integration, access control, and blob storage with migration support.",
  "backend/migration.mo": "Migration module that defines OldActor and NewActor types with ownerAdmins, ownerEmail, and isInitialized fields, providing a run function that copies state from old to new actor during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the removal of Internet Identity authentication checks and guards from the Admin Center page frontend, listing affected files (RoleApplicationsPanel.tsx, useQueries.ts) and related components with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including App.tsx with router setup, useQueries.ts with React Query hooks, Layout.tsx with navigation, various dashboard pages, admin components, and styling files with OKLCH color system and solid white backgrounds.",
  "frontend/index.html": "HTML entry point with comprehensive meta tags for SEO, Open Graph, Twitter cards, PWA manifest, favicons, and iOS/Microsoft tile configurations for ANC Marketplace branding.",
  "frontend/public/manifest.json": "PWA manifest defining ANC Marketplace app metadata, icons in multiple sizes (16x16 to 1024x1024), display mode, theme colors, and screenshots for progressive web app installation.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0, Feb 2026) outlining user responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, intellectual property rights, dispute resolution, prohibited activities, and account termination terms.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy (Feb 2026) describing personal information collection, usage for order processing and support, sharing with service providers and payment processors, data security measures, user rights, cookie usage, and contact information.",
  "frontend/public/policies/returns-policy.md": "Returns policy (Feb 2026) detailing 30-day return eligibility, non-returnable items, return process steps, shipping cost responsibilities, refund processing timeline (5-7 days), exchange procedures, damaged item handling, and 15% restocking fees.",
  "frontend/public/policies/shipping-policy.md": "Markdown document detailing shipping methods, costs, processing times, tracking, international shipping, restrictions, and contact information for ANC Electronics N More and ANC Marketplace.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions covering user eligibility, account registration, marketplace seller/buyer responsibilities, payment terms, liability limitations, dispute resolution, and service fees ($5 per sale, $10/month Store Builder).",
  "frontend/src/App.tsx": "Main application entry point that configures TanStack Router with all route definitions, QueryClient setup, InternetIdentity provider, error boundaries, and toast notifications.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Shows a searchable table of all registered users with their profiles, roles, balances, and creation dates, including refresh functionality and role-based badge styling.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying admin and app URLs with copy-to-clipboard and open-in-new-tab functionality, plus owner email contact information.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages providing a gradient background, container structure, title/subtitle header, and card-styled content area.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "Dropdown menu component with grouped admin actions (user management, marketplace oversight, financial reports, system settings) that currently show 'coming soon' toasts.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Renders a grid of metric cards displaying total revenue, sales counts, pending/failed payments, and total transactions with color-coded icons.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Fetches and displays admin analytics data using SalesMetricsCards component, with loading, error, and refresh states for sales performance metrics.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Provides UI for manual and scheduled employee payment tracking with tabs, forms for payee/amount/notes, and alerts indicating backend integration is pending.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Displays a disabled form for configuring marketplace service fees (currently view-only) with an alert noting backend integration is on the roadmap.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays four financial overview cards showing available funds, total deposited amounts, credit account status, and deposit method breakdowns. Fetches user and transaction data to calculate and format financial metrics in USD.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin dashboard component displaying marketplace development roadmap with progress tracking, completion status, and refresh functionality using custom hooks for data fetching.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Placeholder admin messaging panel component that displays a 'coming soon' alert and empty state. Shows planned features like message threads, filtering, and search functionality.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Message composition form component with recipient selector, subject input, and message body textarea. Validates required fields and calls onSend callback with message data.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a conversation thread with messages between admin and a recipient, showing avatars and timestamps. Includes a reply textarea and send button for responding to messages.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Admin panel for processing marketplace fees and subscription charges via Stripe checkout sessions. Displays buttons to charge sale service fees and store builder subscriptions, with Stripe configuration validation.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card component for owner Stripe Connect account onboarding with a placeholder button. Shows 'not connected' status and alerts that backend integration is pending.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel that groups payment processor configuration cards including StripeSetupCard and OwnerStripeConnectCard. Provides header and description for payment processor management.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Admin card component for configuring Stripe payment integration with secret key and allowed countries, showing configuration status and allowing updates.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel for reviewing pending role applications with approve/reject actions, displaying applicant principals, requested roles with color-coded badges, and table-based UI.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying all transaction history in a table with filtering by type (deposit/credit funding) and status (successful/failed), with currency formatting and refresh capability.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Stub UI for owner withdrawals showing a form for amount, currency, and reason with a warning that backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Displays user role summary statistics (admins, users, guests) in card format with loading and error states, using the useGetUserRoleSummary hook.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat interface for AI assistant with multiple modes (Customer, Seller, Website Builder, Business Operations), supporting text input, speech recognition, and text-to-speech for responses.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget button that toggles the assistant chat panel open/closed in the bottom-right corner of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Auth guard component that requires both Internet Identity authentication and user profile registration, redirecting to login or profile setup as needed.",
  "frontend/src/components/Footer.tsx": "Footer component displaying legal/policy links, contact information (email, phone, address), admin/employee access links, and payment card icons with dynamic year and app identifier.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing sticky header with navigation (customer/seller dropdowns), authentication controls, mobile menu, role-based routing logic, and footer integration.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file for displaying policy documents.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file for managing policy signatures.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file for requiring policy signature acceptance.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed-position banner at bottom of screen for cookie consent with accept/reject buttons and link to privacy policy, using local storage to track consent status.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for collecting user full name and email during initial profile setup, with role-based redirect logic after successful profile creation.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Authentication guard component that redirects authenticated users without profiles to profile setup, shows loading state during profile fetch, and allows public access for unauthenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a full-screen error UI for routing failures with options to refresh the page or navigate home using Tanstack Router and Lucide icons.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections, displaying a detailed error screen with refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that implements human verification with a checkbox and simple math challenge (7+3) before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for six seller onboarding steps (signup, company details, terms, website integration, store setup, marketing) with helper functions to find steps by ID or index.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step wizard component for seller onboarding that manages progress through steps, saves state to backend, and displays progress with navigation controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays placeholder content with an icon, title, description, and optional badge (defaults to 'Coming Soon').",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays detailed lesson content with optional video embed, HTML content rendering, and buttons to mark complete or return to lesson list.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous ICP actor instance, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category, currently returning a placeholder message indicating the feature is under development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, managing login/logout state, identity persistence, and delegation validity checking with configurable AuthClient options.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Custom hook that manages microphone permission state (prompt/granted/denied/unavailable), checks browser support, and provides functions to request and retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Custom hook that tracks whether the page is active by monitoring document visibility and window focus/blur events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend API calls including user profiles, admin checks, role management, seller onboarding, Stripe configuration, earnings, transactions, and admin dashboard data. Includes mutations for initialization, profile updates, role applications, and onboarding with query invalidation on success.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Provides a hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Exports hooks for fetching and saving seller onboarding progress using React Query, with the save mutation currently stubbed as not yet implemented.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for speech recognition with support for continuous listening, interim results, error handling, auto-restart, and microphone permission checks.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create a Stripe checkout session via the backend actor and redirects the browser to the Stripe-hosted checkout URL.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the browser's Speech Synthesis API, managing speaking state and providing speak, stop, and cancel controls.",
  "frontend/src/hooks/useVoicePreferences.ts": "Hook for managing voice preferences (voice activation and spoken replies) with localStorage persistence and reactive state updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette for navy blue theme, menu-specific tokens, animated gradient logo, and voice listening indicator animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent state in localStorage, including get, set, and check operations.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, providing functions to get, set, and clear verification state.",
  "frontend/src/lib/policies.ts": "Defines policy metadata (privacy, shipping, returns, terms, marketplace-wide) with identifiers, display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace ($5 per sale fee) and optional Store Builder subscription ($10/month), including FAQ and marketing text.",
  "frontend/src/lib/voice/browserVoice.ts": "Feature detection and factory functions for Web Speech API (SpeechRecognition and SpeechSynthesis), providing a TTS controller interface for browser-based voice capabilities.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice-related user preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays authenticated user's account overview with profile information (name, email, creation date, role) and navigation cards for settings, billing, and documents.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payment processors, fee configuration, transactions, employee payments, user roles, marketplace roadmap, and messaging with actor timeout handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that initializes access control on first load, handles authentication checks, and displays financial/payment management panels in a tabbed interface.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources with commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace page displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Includes status badges and navigation back to App Center.",
  "frontend/src/pages/ApplyPage.tsx": "Allows authenticated users to apply for Employee or Admin roles by selecting a role card and submitting a reason. Uses useSubmitRoleApplication mutation and displays toast notifications.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Displays a business dashboard with four card sections (B2B Services, Business Credit, Team Management, Analytics) and a placeholder overview section for authenticated users.",
  "frontend/src/pages/CustomerBlog.tsx": "Lists blog posts with categories, read times, and excerpts in a grid layout. Each post card links to detailed content and includes metadata badges.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders individual blog post content based on postId parameter, displaying full article text with metadata (date, category, read time) and back navigation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons, plus a Recent Activity section showing placeholder content.",
  "frontend/src/pages/CustomerFAQ.tsx": "FAQ page for customers with an accordion of common questions about ANC Electronics N Services, including account creation, pricing, payments, refunds, and support contact information.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page with authentication check that displays a placeholder inbox indicating the messaging system is coming soon (inbox-style, not real-time chat).",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Purchase history page with authentication check that displays a placeholder indicating order tracking and purchase history features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with authentication check that manages voice features (microphone permissions, voice activation, spoken replies) and displays permission status with controls to enable/disable voice settings.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons, plus a Recent Updates section showing placeholder content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing ANC Marketplace features (e-commerce, startup program, B2B services) with hero section, feature cards, pricing tiers, and navigation to FAQ pages.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page displaying marketplace policies including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error details, common failure reasons, and action buttons to return to admin center or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with success message and navigation options to admin center or transactions view.",
  "frontend/src/pages/PciCompliancePage.tsx": "Page displaying PCI DSS compliance certificate (cert #02202604883801) with preview, download functionality, and security information for ANC Electronics N More.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page covering information collection, usage, sharing, data security, user rights, and contact information.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Wrapper page component that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with role selection (seller, customer, business, marketer), Internet Identity authentication, and profile creation form with name and email fields.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static returns policy page detailing 30-day return eligibility, non-returnable items, return process, refund timeline, and shipping responsibility.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-filtered metrics (total earnings, orders, items sold) using cards and icons; includes loading/error states and currency/number formatting utilities.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps the SellerOnboardingWizard component with authentication requirement using RequireAuthenticatedRegisteredUser.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Renders a blog listing page with hardcoded posts about B2B, startup programs, store building, integrations, sales funnels, and business credit; each post shows category, date, and read time.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays individual blog post content by postId with navigation back button; contains hardcoded full-text articles for B2B dashboard guide and startup program success stories.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Accordion-based FAQ page answering questions about B2B services, startup assistance, store builder, funnels, dropshipping, payments, team management, analytics, and support.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details in a card layout.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance, service use, account responsibilities, payments, intellectual property, liability limitations, and contact information.",
  "frontend/src/types/index.ts": "Defines comprehensive TypeScript interfaces and types for the application including user profiles, roles, products, orders, educational content, business services, integrations, store customization, and role applications.",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API, including SpeechRecognition interfaces and event handlers for browser speech recognition functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking a critical issue where Version 64 deployment caused application errors due to security guard removal, with pending requests to revert to Version 63 and carefully remove authentication checks blocking Admin Center access while preserving all data."
}