{
  "backend/main.mo": "Defines core backend types for policies, users, products, orders, educational content, payouts, and includes comparison utilities and storage mixin.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent changes for each major frontend file.",
  "frontend/index.html": "HTML entrypoint setting global metadata, branding, PWA manifest link, and the root app mount point.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, colors, screenshots, and metadata for ANC Marketplace.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy detailing platform rules, fees, user responsibilities, prohibited activities, and liability limits.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy outlining data collection, usage, security, user rights, and contact information.",
  "frontend/public/policies/returns-policy.md": "Details return eligibility, non-returnable items, return steps, shipping cost rules, refund timelines, and handling of damaged items and restocking fees.",
  "frontend/public/policies/shipping-policy.md": "Explains shipping methods, costs, processing times, tracking, delivery limits, international rules, and lost or damaged package procedures.",
  "frontend/public/policies/terms-and-conditions.md": "Outlines user responsibilities, marketplace rules, payment terms, liability limits, dispute processes, and conditions for account termination.",
  "frontend/src/App.tsx": "Configures the application's route tree and query client, registering all major pages such as blogs, FAQs, policies, and settings.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Manages assistant knowledge entries with search, add, edit, and category handling, including loading and error states.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Displays unanswered user questions and allows converting them into knowledge base entries, with loading and error handling.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Fetches and displays marketplace roadmap data with progress info, handling loading, errors, and manual refresh.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Shows user role counts for admins, users, and guests, with loading and permission-aware error handling.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat UI with text and voice input, handling speech recognition, TTS, modes, and message flow.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating button and panel wrapper that toggles and displays the assistant chat panel.",
  "frontend/src/components/Footer.tsx": "Renders footer with legal links, contact information, accepted payment icons, and partner sections.",
  "frontend/src/components/Layout.tsx": "Provides the main page layout including header navigation, login/logout handling, banner, voice settings provider, and footer.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Loads and renders markdown policy content with metadata display and signature status checks.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Interface to review, accept, and digitally sign required policies with signature input and submission.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Gate component that blocks access until all required policies are signed, showing alerts when needed.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Displays a cookie consent banner with accept/reject options and persists the user’s choice.",
  "frontend/src/components/ProfileSetup.tsx": "Implements a profile setup form that saves user info via API and shows success or error messages.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a generic routing error screen with options to refresh the page or navigate home.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Catches runtime and unhandled promise errors and shows an error UI with optional details and a refresh button.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Modal requiring a checkbox and simple math challenge to verify human interaction before proceeding.",
  "frontend/src/components/startup/Activities.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays a lesson’s details including video, HTML content, and navigation options.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty placeholder component.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Provides a context combining microphone permission state and voice preference settings, exposing controls for requesting mic access and toggling voice features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Wraps a mutation that sends a question and category to the backend assistant via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, logout, and status tracking through a React context.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Tracks microphone permission status, checks browser support, and provides functions to request or retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Detects whether the page is active based on visibility and focus events.",
  "frontend/src/hooks/useQueries.ts": "Defines many query and mutation hooks using the actor to fetch and update user roles, admin data, policies, and related backend resources.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Provides speech recognition control, tracking transcripts, errors, and auto-restart behavior when supported and permitted.",
  "frontend/src/hooks/useTextToSpeech.ts": "Controls speech synthesis, exposing speak, stop, and cancel functions with state for speaking status and message tracking.",
  "frontend/src/hooks/useVoicePreferences.ts": "Manages voice-related user preferences stored in localStorage, with setters for activation and spoken replies.",
  "frontend/src/index.css": "Defines Tailwind layers, custom color variables for light/dark themes, global base styles, and animations for logo and voice UI states.",
  "frontend/src/lib/cookieConsent.ts": "Handles reading, writing, and checking cookie consent state in localStorage.",
  "frontend/src/lib/humanCheck.ts": "Manages a 30‑minute human verification flag stored in sessionStorage with TTL handling.",
  "frontend/src/lib/policies.ts": "Provides typed metadata for site policies and exports all policy configurations as an array.",
  "frontend/src/lib/pricingCopy.ts": "Centralizes pricing model text and subscription details used across the UI.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection and factories for Web Speech API recognition and speech synthesis controllers.",
  "frontend/src/lib/voice/voicePreferences.ts": "Stores and retrieves user voice feature preferences with versioned localStorage persistence.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AppCenterPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AppLaunchPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty placeholder page component.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CustomerBlog.tsx": "Renders a customer‑facing blog list with cards, categories, and navigation to posts.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Displays individual blog post content using route params and predefined post data.",
  "frontend/src/pages/CustomerFAQ.tsx": "Renders a detailed FAQ page using collapsible sections and centralized pricing copy.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Displays a customer messages page with a login check and placeholder inbox UI indicating messaging is not yet implemented.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no implementation.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Shows a purchase history page gated by login, displaying a placeholder for future order tracking features.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Settings page requiring login, providing voice settings controls, mic permission handling, and policy signatures.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing marketplace features, hero section, and navigation to various service areas.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Renders the marketplace-wide policy document using PolicyDocument.",
  "frontend/src/pages/PaymentFailure.tsx": "Empty file with no implementation.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty file with no implementation.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI DSS compliance certificate details with view/download options and security information.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy document via PolicyDocument.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Renders the returns policy document via PolicyDocument.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Seller payouts dashboard handling payout profiles, account numbers, and debit/credit card requests with form interactions.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Renders a blog listing page showing business-related posts with categories, excerpts, and navigation.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays a full blog post based on route params, pulling detailed content from a local posts map.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Provides an FAQ section for sellers and businesses using accordion components.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Renders the shipping policy document via a shared PolicyDocument component.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty placeholder page for a future startup dashboard.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty placeholder page for the store builder feature.",
  "frontend/src/pages/StorePage.tsx": "Empty placeholder page for the main store interface.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Renders the terms and conditions document via PolicyDocument.",
  "frontend/src/types/index.ts": "Defines frontend TypeScript types for users, products, orders, startup program data, integrations, and store builder configs.",
  "frontend/src/types/speech.d.ts": "Adds TypeScript definitions for the Web Speech API, including SpeechRecognition types.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project’s state, including branding notes, existing feature updates, and pending feature requests around seller payouts and financial tools. Contains metadata, architectural notes, and no known issues."
}