{
  "backend/main.mo": "Defines core backend types for users, products, orders, education modules, integrations, and business programs, along with comparison utilities and includes blob storage mixin.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, related components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and key behavior of multiple frontend files.",
  "frontend/index.html": "HTML entry file configuring metadata, PWA tags, icons, and navy blue theme color.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, start URL, and navy blue theme color.",
  "frontend/src/App.tsx": "Main React app router setup creating routes, layout, error boundaries, and page components.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Admin tool for viewing, creating, editing, toggling, and deleting assistant knowledge base entries with dialog-driven forms.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Admin interface for viewing unanswered questions and converting them into knowledge base entries via a dialog form.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin dashboard component that fetches and displays marketplace roadmap items with progress, error states, and a manual refresh action.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin interface for listing users, filtering, and assigning roles through dialogs with loading and error handling.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Implements a chat interface with mode selection, message handling, and async assistant responses with error fallback.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Provides a floating toggleable widget that opens the AssistantChatPanel inside a styled card.",
  "frontend/src/components/Layout.tsx": "Global layout with header, navigation, auth controls, mobile drawer, promo banner, and assistant widget.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Displays a cookie consent banner with accept/reject options and navigation to the privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "Form for capturing full name and email and saving a user profile via mutation with validation and feedback toasts.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a generic routing error screen with a message and a button linking back to the home page.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary that catches runtime errors and shows an error screen with details and a page refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Renders a human verification dialog with a checkbox and math challenge before allowing continuation.",
  "frontend/src/components/startup/Activities.tsx": "Shows a workflow of user activities with progress tracking and the ability to mark tasks complete.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Displays business credit progress and allows updating verification status with visual indicators.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Lists lessons with progress tracking and supports viewing detailed lesson content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays a lesson’s title, description, video, HTML content, and provides navigation and completion buttons.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Fetches and lists upcoming and past virtual meetings with join buttons and status indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook that sends user questions to the backend assistant actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "Contains numerous React Query hooks for admin actions, user profile stubs, and data fetching using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode, and custom animations and text styles.",
  "frontend/src/lib/cookieConsent.ts": "Handles storing, retrieving, and checking cookie consent status in localStorage.",
  "frontend/src/lib/humanCheck.ts": "Implements a session-based human verification flag with expiration handling.",
  "frontend/src/lib/pricingCopy.ts": "Provides centralized pricing details and descriptive copy for marketplace and store‑builder plans.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard handling authentication, tab navigation, and admin actions like Stripe setup and access control initialization.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Displays affiliate metrics and milestones with placeholder data, requiring login and noting pending backend integration.",
  "frontend/src/pages/AppCenterPage.tsx": "Manages listing, creating, editing, and deleting app integrations with dialogs, forms, and backend query hooks.",
  "frontend/src/pages/AppLaunchPage.tsx": "Launches partner apps in an iframe or new tab, validating authentication and the presence of a target URL.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Provides a scheduling interface embedding a Calendly iframe with links for booking ANC Apprentice Program appointments.",
  "frontend/src/pages/B2BDashboard.tsx": "Shows B2B dashboard cards and links, restricting access to authenticated users with the b2bMember role.",
  "frontend/src/pages/CustomerBlog.tsx": "Displays a grid of blog post previews with categories, dates, excerpts, and navigation to full posts.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders the full content of an individual blog post based on the URL parameter.",
  "frontend/src/pages/CustomerFAQ.tsx": "Shows a structured FAQ list with answers, including pricing details pulled from PRICING_MODEL.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Displays and manages a logged-in user's favorite sellers, with loading, error, and removal functionality.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Provides a placeholder inbox for customer messages, requiring login and noting messaging is coming soon.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Serves as the main customer dashboard with quick links to store features and account management.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Displays a purchase history page with login gating and a placeholder for future order tracking features.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides user settings sections gated by login, with placeholders for profile, privacy, notifications, and account options.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Shows the user's wishlist with login gating, fetches items, handles removal, and displays loading and error states.",
  "frontend/src/pages/FunnelsPage.tsx": "Manages marketing funnel partner configuration with login gating, admin checks, form editing, and external link handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, branding, and feature cards linking to store-related services.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Processes payment success logic, updates subscriptions, handles errors, and redirects after confirmation.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI compliance details with certificate preview and provides buttons to view or download the certificate.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy page with scrollable detailed sections outlining data practices and policies.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Shows a grid of blog posts for sellers and businesses with categories, summaries, and navigation to full posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Loads and displays full content for an individual seller/business blog post based on the post ID.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Provides an FAQ page for sellers and businesses using accordion components to show questions and answers.",
  "frontend/src/pages/StartupDashboard.tsx": "Renders the Startup Program dashboard with membership checks and tabbed sections for lessons, meetings, activities, and business credit.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Displays Store Builder subscription status, templates, and checkout flow with authentication and loading states.",
  "frontend/src/pages/StorePage.tsx": "Shows marketplace products, handles human-check-verified checkout, and manages purchase flow with user authentication.",
  "frontend/src/types/index.ts": "Defines frontend TypeScript types for users, products, orders, startup program content, integrations, and store builder configuration.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, layout, animations, and plugins for the project’s UI styling.",
  "project_state.json": "Stores project metadata, existing features, new feature requests, and tracking info for theme color updates."
}