{
  "backend/main.mo": "Main backend actor defining all data types (UserProfile, Product, EcomOrder, Lesson, VirtualMeeting, SellerOnboardingProgress, PolicySignatureRecord, RoleApplication, etc.) and including MixinStorage for blob storage functionality. Implements comprehensive e-commerce, role management, policy tracking, and business platform features with Map-based storage and comparison modules for ordering.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: removing Internet Identity authentication checks from AdminCenterPage.tsx and preserving all existing Admin Center functionality including role settings, deposits, financial data, transaction history, and user management.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with TanStack Router setup, useQueries hooks for backend operations, Layout with role-based navigation, ProfileSetup modal, various dashboard pages (HomePage, StorePage, StartupDashboard, B2BDashboard, AdminDashboard), payment success/failure pages, and startup/B2B component modules with corrected type imports and hook usage.",
  "frontend/index.html": "HTML entry point with comprehensive meta tags for SEO, Open Graph, Twitter cards, PWA manifest, and app icons. Defines ANC Marketplace branding with theme color #1e3a8a and references generated asset images for favicons and preview images.",
  "frontend/public/manifest.json": "PWA manifest defining ANC Marketplace as a standalone business/productivity/shopping app with multiple icon sizes (16x16 to 1024x1024), portrait orientation, and wide-format screenshot for app store listings.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0, Feb 2026) outlining user responsibilities for customers/sellers/businesses, $5 per-sale service fee structure, payment processing through internal ledger, intellectual property rights, dispute resolution, prohibited activities, and account termination conditions.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy (Feb 2026) detailing personal information collection, usage for order processing and fraud prevention, third-party sharing with payment processors (Authorize.net, Zen dash), data security measures, user rights (access, correction, deletion), cookie usage, and contact information.",
  "frontend/public/policies/returns-policy.md": "Returns policy (Feb 2026) specifying 30-day return window for unused items in original packaging, non-returnable items (digital products, custom items), return process via email authorization, refund processing within 5-7 business days, 15% restocking fee conditions, and damaged/defective item handling procedures.",
  "frontend/public/policies/shipping-policy.md": "Markdown document detailing shipping methods, costs, processing times, tracking, international shipping, restrictions, and contact information for ANC Electronics N More and ANC Marketplace.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions covering user eligibility, account registration, prohibited activities, marketplace seller/buyer responsibilities, service fees, payment processing, liability limitations, dispute resolution, and contact information.",
  "frontend/src/App.tsx": "Main application entry point that configures React Query, TanStack Router with all route definitions (home, admin, dashboards, policies, blogs, payment pages), and wraps the app with providers and error boundaries.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Shows a searchable table of all registered users with their profiles, roles, balances, and creation dates, using the useGetAllUsers hook with refresh capability.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying admin and app URLs with copy-to-clipboard and open-in-new-tab functionality, plus owner email contact information.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages providing a gradient background, container structure, title/subtitle header, and card-styled content area.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "Dropdown menu component with grouped admin actions (user management, marketplace oversight, financial reports, system settings) that shows 'coming soon' toasts on click.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Renders a grid of metric cards displaying total revenue, sales counts, pending/failed payments, and total transactions from AdminCenterAnalytics data.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Displays comprehensive sales analytics using the useGetAdminCenterAnalytics hook, integrating SalesMetricsCards with loading, error, and refresh states.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file placeholder for assistant knowledge base administration functionality.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file placeholder for unanswered questions administration functionality.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Provides UI for manual and scheduled employee payment tracking with tabs, forms for payee/amount/notes, but backend integration is pending (simulated only).",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Displays a view-only interface for configuring marketplace service fees ($5.00 per sale), with backend integration pending for actual updates.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays four financial overview cards showing available funds, total deposited amounts, credit account status, and deposit method breakdowns. Fetches user and transaction data to calculate and format financial metrics in USD.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin panel displaying marketplace development roadmap with progress tracking, completion status badges, and refresh functionality using custom hooks for data fetching.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "A placeholder admin messaging panel component that displays a 'coming soon' message with planned features like user communication, conversation threads, and message filtering. Currently shows an informational alert and disabled compose button.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "A message composition form component with recipient selection, subject input, and message body textarea. Validates required fields and calls onSend callback with message data when submitted.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a conversation thread with messages between admin and users, showing avatars and message bubbles aligned by sender. Includes a reply textarea and send button at the bottom.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Manages marketplace revenue collection through Stripe, providing buttons to charge sale service fees and store builder subscription fees. Checks Stripe configuration status and creates checkout sessions for fee collection.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "A placeholder card for owner Stripe Connect account onboarding that displays a 'not connected' status and alert about pending backend integration. Shows planned features like payouts and transaction tracking.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container component that displays payment processor configuration options, including StripeSetupCard and OwnerStripeConnectCard components. Provides a unified interface for managing marketplace payment integrations.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Card component for configuring Stripe payment processor with secret key and allowed countries, showing configuration status and allowing updates.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Table-based admin panel for reviewing and managing pending user role applications with approve/reject actions, role badges, and principal ID display using ICP backend queries.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying all transaction history in a table with filtering, formatting for currency/dates, and status badges for deposits and credit funding transactions.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Stub UI for owner withdrawals showing a form for amount, currency, and reason with a warning that backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Displays user role summary statistics (admin, user, guest counts) with loading and error states, using the useGetUserRoleSummary hook to fetch data.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat interface for AI assistant with multiple modes (Customer, Seller, Builder, Operations), supporting text input, speech recognition, and text-to-speech for responses.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget button that toggles the assistant chat panel open/closed in the bottom-right corner of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Authentication guard component that checks for Internet Identity login and user profile, redirecting to login or profile setup if needed before rendering children.",
  "frontend/src/components/Footer.tsx": "Footer component displaying legal/policy links, contact information (email, phone, address, EIN), admin/employee access links, and payment card icons organized in a responsive grid layout.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, authentication controls, role-based dropdown menus for customers and sellers/businesses, mobile menu support, and automatic role-based routing after login.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file with no content.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file with no content.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file with no content.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed-position banner at bottom of screen prompting users to accept or reject cookie consent, with link to privacy policy and local storage persistence.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for collecting user profile information (full name, email) during initial setup, with role-based redirect logic after successful profile creation.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Authentication guard component that redirects unauthenticated users with profiles to profile setup, shows loading state during profile fetch, and allows public access for non-authenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a full-screen error UI for routing failures with options to refresh the page or navigate home using Tanstack Router and Lucide icons.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections, displaying a detailed error screen with refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that implements a simple human verification check with a checkbox and a basic math challenge (7+3) before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for seller onboarding steps including signup, company details, terms, website integration, store setup, and marketing, with most marked as placeholders.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step wizard component for seller onboarding that manages progress through steps, saves state to backend, and displays progress with navigation controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays placeholder content for upcoming seller profile features with an icon, title, description, and 'Coming Soon' badge.",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays detailed lesson content with video embed, HTML content rendering, and a button to mark lessons as complete.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category, currently returning a placeholder message indicating the feature is under development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider that manages AuthClient lifecycle, identity state, login/logout flows, and session persistence with configurable options.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Hook that manages browser microphone permission state (prompt/granted/denied/unavailable), checks current permissions, and provides methods to request and retry permission access.",
  "frontend/src/hooks/usePageActivity.ts": "Hook that tracks whether the page is currently active by monitoring document visibility and window focus/blur events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend API calls including user profiles, admin checks, role applications, seller onboarding, Stripe configuration, transactions, earnings, and analytics. Includes mutations for initialization, profile saving, and role management with automatic query invalidation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Custom hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks for fetching and saving seller onboarding progress state with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for speech-to-text functionality with support for continuous listening, interim results, auto-restart, and microphone permission checking.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create Stripe checkout sessions for shopping cart items and redirects the user to the Stripe-hosted checkout page.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the Web Speech Synthesis API with state tracking for speaking status and message IDs.",
  "frontend/src/hooks/useVoicePreferences.ts": "Custom hook for managing voice feature preferences (voice activation and spoken replies) with localStorage persistence.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom OKLCH color tokens for a navy blue theme, menu styling, animated gradient logo, and voice UI animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent state in localStorage with get, set, and check operations.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, providing functions to check, set, and clear verification state.",
  "frontend/src/lib/policies.ts": "Defines policy metadata (privacy, shipping, returns, terms, marketplace) with identifiers, display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace ($5 per sale fee) and optional Store Builder subscription ($10/month) with FAQ text.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection and factory functions for Web Speech API (SpeechRecognition and SpeechSynthesis) with a TTS controller interface.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays authenticated user's account overview with profile information (name, email, creation date, role) and navigation cards for settings, billing, and documents.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payment processors, fee configuration, transactions, employee payments, user roles, and messaging with actor timeout handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that initializes access control on first load, handles authentication checks, and displays financial/payment management panels in a tabbed interface.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace page displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Includes status badges and navigation back to App Center.",
  "frontend/src/pages/ApplyPage.tsx": "Allows authenticated users to apply for Employee or Admin roles by selecting a role and providing a reason. Submits applications via useSubmitRoleApplication hook.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "B2B business dashboard showing four service cards (B2B Services, Business Credit, Team Management, Analytics) with a placeholder overview section for metrics.",
  "frontend/src/pages/CustomerBlog.tsx": "Displays a grid of blog posts with categories, read times, and excerpts covering topics like getting started, security, shopping tips, subscriptions, and support.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders individual blog post content based on postId parameter, displaying full article text with metadata (date, category, read time) and back navigation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons, plus a Recent Activity section showing placeholder content.",
  "frontend/src/pages/CustomerFAQ.tsx": "Customer FAQ page with an accordion of frequently asked questions about ANC Electronics N Services, covering account creation, products, pricing, payments, refunds, support, and the Store Builder subscription.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page that requires authentication and displays a placeholder card indicating the messaging system is coming soon with inbox-style (non-real-time) messaging.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Customer purchase history page that requires authentication and displays a placeholder card indicating order tracking features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with voice and permissions configuration, including microphone access controls, voice activation toggle, and spoken replies toggle with permission status indicators.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons, plus a Recent Updates section showing placeholder content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying ANC Marketplace hero section, three feature cards (E-Commerce, Startup Program, B2B Services), and a pricing section with subscription tiers and payment options.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page displaying marketplace policies including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error icon, common failure reasons list, and buttons to return to admin center or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with success icon and navigation options to return to admin center or view transaction history.",
  "frontend/src/pages/PciCompliancePage.tsx": "Page displaying PCI DSS compliance certificate with preview image, download/view buttons, and information about security standards and customer benefits.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static page outlining privacy policy including information collection, usage, sharing practices, data security measures, and user rights.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple wrapper page that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with role selection (Seller, Customer, Business, Marketer), Internet Identity authentication, and form to collect full name and email before saving user profile.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static page detailing returns policy including 30-day eligibility, non-returnable items, return process, refund timeline, and shipping responsibility.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-frame filtering (today/week/month/all-time), showing total earnings, orders, and shipped items using cards with loading/error states.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps the SellerOnboardingWizard component with authentication requirement for registered users.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog posts for sellers and businesses covering topics like B2B dashboard, startup program, store builder, integrations, sales funnels, and business credit.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post content with navigation back to blog list, displaying full article text for various seller/business topics based on post ID.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays accordion-style FAQ page covering B2B services, startup assistance, store builder, integrations, payment processing, analytics, and support for business users.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance of terms, service use, account responsibilities, payments, intellectual property, liability limitations, and contact information.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces and enums for the entire application including user profiles, products, orders, educational content, business services, integrations, store customization, and various discriminated union types for status variants.",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API (SpeechRecognition), including interfaces for recognition events, results, and browser-specific implementations (webkit prefix support).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations.",
  "project_state.json": "Project state tracking document indicating the ANC Marketplace needs Internet Identity authentication guards removed from Admin Center (frontend and backend) to restore access while preserving existing role settings and data."
}