{
  "backend/main.mo": "Main actor module defining comprehensive types (user roles, products, orders, policies, onboarding, payments) and including MixinStorage for blob storage functionality with migration support.",
  "backend/migration.mo": "Migration module that transforms old actor state (single ownerPrincipal) to new state (ownerAdmins list and isInitialized flag).",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence UI improvements: hero section text styling for visibility and solid backgrounds for popups/modals.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components covering routing, dashboards, profile setup, store pages, and various business modules with implementation details.",
  "frontend/index.html": "HTML entry point with comprehensive meta tags, PWA manifest, social media cards, and multi-size favicon references for ANC Marketplace application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icon sets (16px to 1024px), and screenshots for standalone mobile/desktop installation.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0) outlining user responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, intellectual property, and dispute resolution.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy explaining data collection (personal and automatic), usage, sharing practices, security measures, user rights, and cookie usage with contact information.",
  "frontend/public/policies/returns-policy.md": "Returns policy detailing 30-day return eligibility, non-returnable items, return process, refund timeline (5-7 days), exchange procedures, and 15% restocking fee conditions.",
  "frontend/public/policies/shipping-policy.md": "Markdown document detailing shipping methods, costs, processing times, tracking, international shipping, restrictions, and contact information for ANC Electronics N More and ANC Marketplace.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions covering user eligibility, account responsibilities, marketplace seller/buyer terms, payment processing, liability limitations, dispute resolution, and service fees for ANC Marketplace.",
  "frontend/src/App.tsx": "Main application entry point that configures TanStack Router with all route definitions, QueryClient setup, InternetIdentity provider, error boundaries, and toast notifications.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying app and admin URLs with copy-to-clipboard and open-in-new-tab functionality, plus owner email contact information.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages providing a gradient background, container structure, title/subtitle header, and card-styled content area.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "React component for managing employee payments with tabs for manual and scheduled payments. Currently simulated with no backend integration, includes form inputs for payee, amount, cadence, and notes.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "React component for configuring marketplace service fees (per-sale fee). Currently view-only with disabled save functionality pending backend integration.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "React component displaying three financial metric cards: available funds, business credit account status, and payroll savings. Formats currency from cents to USD display.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin panel displaying marketplace development roadmap with progress tracking, completion status badges, and refresh functionality using custom hooks for dashboard data.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "React component for processing revenue charges via Stripe, including marketplace sale fees and store builder subscriptions. Checks Stripe configuration status and creates checkout sessions using pricing constants.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "React component for owner Stripe Connect account onboarding. Currently shows 'Not Connected' status with placeholder functionality pending backend HTTP outcalls and ledger system implementation.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "React component that serves as a container for payment processor configuration, including StripeSetupCard and OwnerStripeConnectCard components.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "React component for configuring Stripe payment processor with secret key and allowed countries. Uses custom hooks to check configuration status and save settings, with conditional UI based on configuration state.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel for reviewing pending role applications with approve/reject actions, displaying applicant principals, requested roles, and status in a table format.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Displays a table of all financial transactions with filtering, status badges, and refresh functionality. Fetches transaction history via useGetAllTransactionHistory hook and formats currency/dates for display.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "A stub UI for owner withdrawals showing a form to request payouts with amount, currency, and reason fields. Displays an alert indicating backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Dashboard component showing user role summary statistics (admins, users, guests) in card format with loading and error states.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat interface for the ANC Assistant with multiple modes (Customer, Seller, Website/App Builder, Business Operations), supporting text input, voice recognition, and text-to-speech. Integrates speech recognition and TTS hooks with voice settings context.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "A floating button widget that toggles the AssistantChatPanel visibility. Renders a message circle icon that switches to an X when open.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Authentication guard component that checks for Internet Identity login and user profile, redirecting to login or profile setup as needed. Shows loading states during authentication checks.",
  "frontend/src/components/Footer.tsx": "Footer component displaying legal/policy links, contact information (email, phone, address), admin/employee access links, and payment card icons with dynamic year and app identifier.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header navigation, authentication controls, role-based routing logic, dropdown menus for customer/seller sections, mobile menu support, and footer integration.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file with no content.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file with no content.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file with no content.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Displays a fixed-position cookie consent banner on first visit with Accept/Reject buttons and a link to the privacy policy. Uses local storage to persist consent choice.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for collecting user profile information (full name, email) during initial registration with role-based redirect logic after submission.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Authentication guard component that redirects unauthenticated users with profiles to profile setup, shows loading states, and allows public access for non-authenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a full-screen error UI for routing failures with options to refresh the page or navigate home using Tanstack Router and Lucide icons.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections, displaying a detailed error screen with refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Modal dialog for human verification requiring a checkbox confirmation and a simple math challenge (7+3). Validates both conditions before calling onVerified callback.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for six seller onboarding steps (signup, company details, terms, website integration, store setup, marketing) with helper functions to find steps by ID or index.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "Multi-step wizard component for seller onboarding that manages navigation between steps, tracks completion progress, and persists state to backend using React hooks and TanStack Router.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "Reusable card component that displays placeholder content with an icon, title, description, and optional badge (defaults to 'Coming Soon').",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Component that displays detailed lesson content including video embed, HTML content, and action buttons to mark complete or navigate back.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages ICP actor creation with authentication, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category; currently returns a placeholder message as backend is not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider that manages login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Hook that manages browser microphone permission state (prompt/granted/denied/unavailable) with methods to request permission and check current status.",
  "frontend/src/hooks/usePageActivity.ts": "Hook that tracks whether the page is active by monitoring document visibility and window focus/blur events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend API calls including user profiles, admin checks, role applications, seller onboarding, Stripe configuration, transactions, and earnings. Includes mutations for initialization, profile saving, and role management with automatic query invalidation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Custom hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks for fetching and saving seller onboarding progress state with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for speech-to-text functionality with support for continuous listening, interim results, error handling, and automatic restart capabilities.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create Stripe checkout sessions for shopping cart items and redirects the user to the Stripe-hosted checkout page.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the browser's Speech Synthesis API with controls for speaking, stopping, and tracking current speech state.",
  "frontend/src/hooks/useVoicePreferences.ts": "Custom hook for managing voice feature preferences (voice activation and spoken replies) with localStorage persistence.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom OKLCH color palette (navy blue theme), menu styling components, animated gradient logo, and voice listening indicator animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent state in localStorage with get, set, and check operations.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, providing functions to get, set, and clear verification state.",
  "frontend/src/lib/policies.ts": "Defines policy metadata (privacy, shipping, returns, terms, marketplace) with identifiers, display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace ($5 per sale fee) and optional Store Builder subscription ($10/month) with FAQ text.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection and factory functions for Web Speech API (SpeechRecognition and SpeechSynthesis) with a TTSController interface for text-to-speech operations.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentity providers wrapping the main App component.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays authenticated user's account overview with profile information (name, email, creation date, role) and navigation cards for settings, billing, documents, and support.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payment processors, revenue, fees, transactions, employee payments, transfers, user roles, marketplace roadmap, access links, and role applications; includes access control initialization.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authentication checks, access control initialization, and tabbed interface for financial state, payment processors, fees, transactions, employee payments, transfers, revenue, and access links.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources with a commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace page displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons for authenticated users.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Includes status badges and navigation back to App Center.",
  "frontend/src/pages/ApplyPage.tsx": "Role application page where authenticated users can apply for Employee or Admin roles by selecting a role card and submitting a reason. Uses useSubmitRoleApplication mutation and displays toast notifications.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "B2B business dashboard showing four card sections (B2B Services, Business Credit, Team Management, Analytics) with icons and a placeholder business overview section.",
  "frontend/src/pages/CustomerBlog.tsx": "Blog listing page displaying customer-focused articles with categories, read times, and excerpts. Shows five hardcoded blog posts about getting started, security, shopping tips, subscriptions, and support.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Individual blog post viewer that displays full article content based on postId parameter. Contains detailed content for posts like getting-started-guide and secure-shopping-tips with formatted paragraphs.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons and hover effects, plus a Recent Activity section showing placeholder content.",
  "frontend/src/pages/CustomerFAQ.tsx": "Customer FAQ page with an accordion of frequently asked questions covering account creation, products, pricing, payments, refunds, support contact, and Store Builder subscription details.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page that requires authentication and displays a placeholder card indicating the messaging system is coming soon with inbox-style (non-real-time) messaging.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Customer purchase history page that requires authentication and displays a placeholder card indicating order tracking and purchase history features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with voice and microphone permission controls, including toggles for voice activation and spoken replies, permission status display, and browser compatibility checks for speech features.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons and hover effects, plus a Recent Updates section showing placeholder content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying ANC Marketplace hero section, three feature cards (E-Commerce, Startup Program, B2B Services), pricing model information, and call-to-action buttons for navigation.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page displaying marketplace policies including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error icon, common failure reasons list, and buttons to return to admin center or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with success icon and navigation buttons to return to admin center or view transaction history.",
  "frontend/src/pages/PciCompliancePage.tsx": "Page displaying PCI DSS compliance certificate (cert #02202604883801) with preview image, download/view buttons, and security benefits explanation.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page covering information collection, usage, sharing, data security, user rights, and contact information.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Wrapper page component that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page allowing users to select a role (Seller, Customer, Business, Marketer), authenticate via Internet Identity, and complete profile setup with name and email.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static returns policy page detailing 30-day return eligibility, non-returnable items, return process, refund timeline, and shipping responsibility.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-frame filtering (today/week/month/all-time), showing total earnings, orders, products sold, and average order value using cards and formatted currency/numbers.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps the SellerOnboardingWizard component with RequireAuthenticatedRegisteredUser authentication guard.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog post cards covering B2B, startup programs, store builder, integrations, sales funnels, and business credit topics with navigation to individual posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post content with title, metadata, and multi-paragraph content based on postId parameter from route.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays an accordion-based FAQ page covering B2B services, subscriptions, startup programs, integrations, store builder, payments, analytics, and support topics.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance, service use, account responsibilities, payments, intellectual property, liability limitations, and contact information.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces and enums for the entire application including user profiles, products, orders, educational content, B2B services, dropshipping partners, app integrations, store templates, and branding assets. Includes helper functions for AccessRole variants (guest, startUpMember, b2bMember).",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API, including SpeechRecognition interfaces, events, and result types for speech-to-text functionality. Declares both standard and webkit-prefixed SpeechRecognition constructors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended shadows including menu-specific styles, container settings, border radius variables, and accordion animation keyframes. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking document for ANC Marketplace showing pending feature requests including admin access control initialization for two Internet Identity principals, hero section text styling, popup background improvements, and admin functionality enhancements. Documents known issue with 'Actor not available' error in admin center."
}