{
  "backend/main.mo": "Defines core backend types for policies, users, products, orders, educational content, and includes comparison modules and storage mixins.",
  "feature_evidence.json": "Lists feature evidence linking updated header navigation styling to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "Provides concise per-file summaries for key frontend components, pages, hooks, and styles across the application.",
  "frontend/index.html": "Base HTML entry point with metadata, PWA tags, icons, and root mount for the frontend app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, categories, and screenshots.",
  "frontend/public/policies/marketplace-policy.md": "Markdown document outlining marketplace rules, responsibilities, fees, and prohibited activities.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy detailing data collection, usage, rights, and security measures.",
  "frontend/public/policies/returns-policy.md": "Returns policy describing eligibility, process, refunds, and exclusions.",
  "frontend/public/policies/shipping-policy.md": "Defines shipping methods, costs, processing times, tracking, restrictions, and procedures for lost or damaged packages.",
  "frontend/public/policies/terms-and-conditions.md": "Outlines user responsibilities, marketplace rules, payments, liability limits, dispute resolution, and account termination terms.",
  "frontend/src/App.tsx": "Sets up the React app’s router, query client, and routes for pages like FAQs, blogs, policies, settings, and admin.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no implemented component.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Admin interface for viewing, searching, adding, and editing assistant knowledge base entries with dialogs and validation.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Admin panel listing unanswered questions and allowing conversion into knowledge base entries via a dialog workflow.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin panel that loads, displays, and refreshes marketplace roadmap data with progress metrics and error handling.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin view showing user role counts with loading and permission error states.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Full-featured assistant chat UI supporting text, speech recognition, text‑to‑speech, mode switching, and auto-scrolling.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating AI assistant button that opens a chat panel component.",
  "frontend/src/components/Footer.tsx": "Renders footer with legal links, contact information, and accepted payment methods.",
  "frontend/src/components/Layout.tsx": "Provides the main layout with header navigation, authentication handling, banner, mobile menu, and footer.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Loads and displays a policy file with basic markdown rendering and signature status checks.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "UI for reviewing, accepting, and digitally signing policies, integrating backend signature submission.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Gatekeeper component that blocks access until all required policies are signed.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Shows a dismissible cookie consent banner and stores the user’s choice.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a form for users to submit their name and email to create a profile using a backend mutation.",
  "frontend/src/components/RouterErrorScreen.tsx": "Shows an error screen for routing failures with options to refresh or return home.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary that catches runtime and unhandled promise errors and displays a recovery UI with technical details and a refresh button.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Modal dialog requiring a checkbox and math challenge to verify user is human.",
  "frontend/src/components/startup/Activities.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays lesson details including video, HTML content, and navigation controls.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty placeholder component.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Context provider for microphone permission state and voice preference settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAssistant.ts": "Mutation hook for asking questions to the backend assistant API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking via Dfinity AuthClient.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Manages microphone permission state, checks browser support, watches permission changes, and requests access via getUserMedia.",
  "frontend/src/hooks/usePageActivity.ts": "Tracks whether the page is active by listening to visibility, focus, and blur events.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for roles, admin data, policy identifiers, mutations, and permission handling.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Implements speech-to-text using browser speech recognition, handling permissions, events, transcripts, errors, and optional auto-restart.",
  "frontend/src/hooks/useTextToSpeech.ts": "Controls browser text-to-speech playback with state tracking, speak/stop/cancel actions, and support checks.",
  "frontend/src/hooks/useVoicePreferences.ts": "Loads and updates stored voice-related user preferences such as activation and spoken replies.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color variables, menu styles, animated logo text, and voice UI animations.",
  "frontend/src/lib/cookieConsent.ts": "Provides helpers to get/set cookie consent state in localStorage.",
  "frontend/src/lib/humanCheck.ts": "Implements a session-based human verification flag with a 30‑minute TTL and utilities to read, set, or clear it.",
  "frontend/src/lib/policies.ts": "Defines policy identifiers and metadata, and exports a metadata map plus an array of all policies.",
  "frontend/src/lib/pricingCopy.ts": "Provides centralized pricing model text and standalone site pricing details for display in the UI.",
  "frontend/src/lib/voice/browserVoice.ts": "Implements browser feature checks and factories for speech recognition and text‑to‑speech controllers.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice feature preferences using localStorage with versioning and helper setters.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AccountPortalPage.tsx": "Renders the authenticated account portal with navigation to payouts, business settings, and financial services.",
  "frontend/src/pages/AdminCenterPage.tsx": "Displays admin‑only financial dashboards with authentication, authorization checks, and loading/error handling.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty placeholder page.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/AppCenterPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/AppLaunchPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty placeholder page.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty placeholder page.",
  "frontend/src/pages/CustomerBlog.tsx": "Renders a customer‑facing blog listing with categories, excerpts, and navigation to posts.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Loads a blog post by ID and displays full content with navigation controls.",
  "frontend/src/pages/CustomerFAQ.tsx": "Renders a customer FAQ page using accordions with questions, answers, and pricing model references.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Displays a messages page with login gating and a placeholder inbox indicating messaging is coming soon.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Shows purchase history UI with login check and a placeholder indicating order tracking is coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides account settings including voice permissions, mic handling, and policy signatures, gated behind login.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Home page showcasing marketplace features, hero section, and navigation links to key services.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Renders the marketplace-wide policy document via a PolicyDocument component.",
  "frontend/src/pages/PaymentFailure.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI compliance certificate details with view/download options and security explanations.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy using the PolicyDocument component.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Renders the returns policy via the PolicyDocument component.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Page for managing seller payouts, bank accounts, and business debit/credit card requests with query hooks and forms.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Renders a blog index of curated posts for sellers and businesses with navigation to individual posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays a single blog post based on URL params using a local posts map.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "FAQ page listing common questions about business and B2B features using accordion components.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Loads and displays the shipping policy document via the shared PolicyDocument component.",
  "frontend/src/pages/StartupDashboard.tsx": "Placeholder file with no implemented content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Placeholder file for the store builder page with no implemented content.",
  "frontend/src/pages/StorePage.tsx": "Placeholder file for the main store page with no implemented content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the terms and conditions document via the PolicyDocument component.",
  "frontend/src/types/index.ts": "Defines shared frontend TypeScript types for users, products, orders, programs, integrations, and store builder data.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript definitions for the Web Speech API including SpeechRecognition and related events.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, existing and new feature requests, and versioned state for menu background and readability improvements."
}