{
  "backend/main.mo": "Defines core backend actor with types for users, products, orders, educational content, business credit, dropshipping partners, B2B services, and comparisons for sorting.",
  "feature_evidence.json": "Lists verified feature evidence describing banner, button, and appointment dashboard53 implementation with file mappings and test IDs.",
  "frontend-file-summaries.txt": "Provides short summaries for each frontend file including pages, components, hooks, and styling.",
  "frontend/index.html": "Base HTML entry point with metadata, icons, PWA manifest link, and root div for the React app.",
  "frontend/public/manifest.json": "PWA configuration defining app name, icons, theme colors, categories, and screenshots.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, authentication handling, profile setup gating, and theme provider.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin interface for viewing users, filtering them, and assigning or updating access and system roles.",
  "frontend/src/components/Layout.tsx": "Defines global layout with navigation, authentication controls, role badges, banner area, and mobile menu.",
  "frontend/src/components/ProfileSetup.tsx": "Form component allowing users to submit name and email to create their profile using a backend mutation.",
  "frontend/src/components/startup/Activities.tsx": "Displays user activities, progress tracking, and lets users mark activities as complete.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Shows business credit progress and lets users update verification and bureau registration statuses.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Lists lessons, tracks completion progress, and supports navigating into lesson details.",
  "frontend/src/components/startup/LessonDetail.tsx": "Renders a full lesson view with video, content, and a button to mark the lesson as complete.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Displays upcoming and past virtual meetings for the logged-in user, with detailed meeting cards and links to join or view recordings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and state management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching and mutating user profiles, roles, products, meetings, activities, and other backend data.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode themes, and custom animated text and branding CSS utilities.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider and mounts it with global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements the admin dashboard UI with tabs and CRUD controls for products, orders, lessons, meetings, activities, services, integrations, and user roles.",
  "frontend/src/pages/AppCenterPage.tsx": "Manages CRUD operations for app integrations with dialogs, form validation, and identity-gated access. Uses hooks to load, add, update, delete, and configure webhook integrations.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Displays a scheduling dashboard embedding a Calendly iframe with links and supporting UI. Includes description of an apprenticeship program.",
  "frontend/src/pages/B2BDashboard.tsx": "Shows an authenticated B2B dashboard with stats, tabs, and recent project listings. Redirects users without the B2B role.",
  "frontend/src/pages/FunnelsPage.tsx": "Allows authenticated users to view and admins to configure funnel partner settings. Includes URL validation, dialogs, and integration updates.",
  "frontend/src/pages/HomePage.tsx": "Landing page presenting business features and service categories with navigation actions. Includes hero section, branding, and feature cards.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure message with retry and home navigation options. Provides simple error UI with icon and card layout.",
  "frontend/src/pages/PaymentSuccess.tsx": "Processes successful plan purchases and registers users with appropriate roles. Shows confirmation UI and routes users to the correct dashboard.",
  "frontend/src/pages/StartupDashboard.tsx": "Renders the startup member dashboard with sections, role-gating, and tabbed content for classes, meetings, activities, and business credit.",
  "frontend/src/pages/StorePage.tsx": "Implements the store interface with product listing, plan selection, cart actions, and checkout session creation using user authentication.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and content paths for styling across the project.",
  "project_state.json": "Stores high-level project metadata, architectural notes, existing features, and known issues for ANC Marketplace."
}