{
  "backend/main.mo": "Main backend actor defining all data types (user roles, products, orders, lessons, policies, onboarding, payments) and implementing business logic for e-commerce, user management, role applications, financial transactions, seller onboarding, policy signatures, and admin operations with access control and Stripe integration.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: admin center backend connection fix, user accounts/transaction history display, sales reports/analytics dashboard, and internal messaging system, each mapped to specific files, components, and test requirements.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components, pages, and hooks including admin dashboards, customer/business/employee dashboards, role-based navigation, profile setup, payment flows, startup program modules, and TanStack Query hooks for backend integration.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph/Twitter cards, PWA manifest link, favicon references, and iOS/Microsoft tile configurations for ANC Marketplace branding.",
  "frontend/public/manifest.json": "PWA manifest defining ANC Marketplace as a standalone app with multiple icon sizes (16x16 to 1024x1024), theme colors, orientation settings, and business/productivity/shopping categories.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0, Feb 2026) outlining user responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, intellectual property rights, prohibited activities, dispute resolution, and liability limitations.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy (Feb 2026) detailing information collection practices, usage of personal/automated data, third-party sharing (payment processors, service providers), data security measures, user rights (access, correction, deletion), and cookie usage.",
  "frontend/public/policies/returns-policy.md": "Markdown document detailing the returns policy including 30-day return eligibility, non-returnable items, return process steps, refund processing timelines, restocking fees, and contact information for ANC Electronics N Services.",
  "frontend/public/policies/shipping-policy.md": "Markdown document outlining shipping methods (standard, expedited, express), costs, processing times, tracking, international shipping terms, delivery restrictions, and procedures for lost or damaged packages.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions document covering user eligibility, account registration, prohibited activities, marketplace seller/buyer responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, liability limitations, and dispute resolution governed by Florida law.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router with all route definitions, QueryClient configuration, InternetIdentity provider, error boundaries, and renders the Layout wrapper with Toaster notifications.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Displays all registered users in a searchable table with role badges, account balances, and creation dates, including refresh functionality and currency formatting.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying admin access URLs (app link and admin sign-in link) with copy-to-clipboard and open-in-new-tab functionality, plus owner email contact information.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages providing gradient background, container structure, title/subtitle header, and white card content area.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "Dropdown menu component with grouped admin actions (user management, marketplace oversight, financial reports, system settings) that currently show 'Coming Soon' toasts when clicked.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Renders a grid of metric cards showing total revenue, sales counts, pending/failed payments, and total transactions with color-coded icons.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Main sales analytics panel that fetches admin center analytics data and displays SalesMetricsCards with loading, error, and refresh states.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Provides UI for manual and scheduled employee payment tracking with tabs, forms for payee/amount/notes, and a notice that backend integration is pending.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Admin panel for configuring marketplace service fees (currently view-only at $5.00 per sale). Includes UI for editing fees with save functionality disabled pending backend integration.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays three financial overview cards showing available funds, business credit (limit and used amount), and payroll savings. Formats currency values from cents to USD.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin dashboard component displaying marketplace development roadmap with progress tracking, completion status badges, and refresh functionality using useGetAdminDashboardData and useUpdateAdminDashboardData hooks.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Placeholder admin messaging panel with a 'coming soon' alert describing future features like user communication, conversation threads, and message filtering. Shows empty state with compose button.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Message composition form with recipient selector, subject input, and message body textarea. Validates required fields before allowing send.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a conversation thread with messages, avatars, and timestamps. Includes a reply textarea and handles sending replies.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Admin panel for processing marketplace fees and subscription charges via Stripe checkout. Includes buttons to charge sale fees ($5) and store builder subscriptions ($29.99/month).",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card for owner Stripe Connect account onboarding (not yet implemented). Shows 'Not Connected' status and explains payout functionality pending backend integration.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel that displays payment processor configuration cards including StripeSetupCard and OwnerStripeConnectCard.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Card component for configuring Stripe payment processor with secret key and allowed countries, showing configuration status and allowing updates.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Displays pending role applications in a table with approve/reject actions, using custom hooks for fetching and mutating application data and showing role badges with color coding.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying all transaction history in a table with filtering, formatting for currency/dates, and status badges for deposits and credit funding transactions.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Stub UI for owner withdrawals showing a form for amount, currency, and reason with a warning that backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Shows user role summary statistics (admin, user, guest counts) in card format with loading and error states, including permission-denied handling.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat interface for AI assistant with multiple modes (Customer, Seller, Builder, Operations), supporting text input, speech recognition, and text-to-speech for responses.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget button that toggles the assistant chat panel open/closed in the bottom-right corner of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Authentication guard component that checks for Internet Identity login and user profile, redirecting to login or profile setup if needed before rendering children.",
  "frontend/src/components/Footer.tsx": "Footer component displaying four columns: legal/policy links, contact information (including EIN, DBA, owner details, email, phone, address), access links for admin/employee/seller dashboards, and payment method icons with copyright notice.",
  "frontend/src/components/Layout.tsx": "Main layout component providing sticky header with navigation (Customer and Sellers/Businesses dropdowns), authentication button, mobile menu sheet, role-based routing logic, and Footer component wrapper for all pages.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file placeholder for policy document display component.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file placeholder for policy signatures management panel component.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file placeholder for policy signature requirement guard component.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed-position banner at bottom of screen for cookie consent with accept/reject buttons and link to privacy policy, using local storage to track consent status.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for new users to complete their profile by entering full name and email, then redirects to role-specific dashboard after saving via useSaveCallerUserProfile hook.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Higher-order component that checks if authenticated users have a profile and redirects to profile setup if missing, while allowing public access for unauthenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Error screen component displayed when routing errors occur, offering refresh and home navigation options with AlertCircle icon.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections, displaying a detailed error screen with refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that implements human verification with a checkbox and a simple math challenge (7+3) before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for six seller onboarding steps (signup, company details, terms, website integration, store setup, marketing) with helper functions to look up steps by ID.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step wizard component for seller onboarding that displays progress, manages step navigation, and persists onboarding state to the backend.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays placeholder content with an icon, title, description, and optional badge (defaults to 'Coming Soon').",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays detailed lesson content including an embedded video iframe, HTML content, and action buttons to mark complete or return to lesson list.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using React Query, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category, currently returning a placeholder message indicating the feature is under development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and status tracking with delegation validation.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Custom hook that manages microphone permission state (prompt/granted/denied/unavailable), checks browser support, and provides functions to request and retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Custom hook that tracks whether the page is active by monitoring document visibility and window focus/blur events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend API calls including user profiles, admin checks, role management, seller onboarding, Stripe configuration, transactions, earnings, and analytics. Includes mutations for initialization, profile updates, role applications, and query hooks for fetching various data types.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Custom hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks for fetching and saving seller onboarding progress state, with automatic cache invalidation on updates.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook that wraps the Web Speech API for speech recognition, supporting continuous listening, interim results, auto-restart, and permission-based activation with transcript management.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook for creating Stripe checkout sessions with shopping items, handling success/cancel URLs and redirecting to Stripe's hosted checkout page.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the Web Speech Synthesis API, managing speaking state and providing speak/stop/cancel controls with message tracking.",
  "frontend/src/hooks/useVoicePreferences.ts": "Custom hook for managing voice-related user preferences (voice activation and spoken replies) with localStorage persistence and reactive updates.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom design tokens for a navy blue color scheme, menu styling, animated gradient logo, and voice UI animations. Forces light mode and high-contrast menu components.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent state in localStorage, including getting, setting, and checking consent status.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, providing functions to check, set, and clear verification state.",
  "frontend/src/lib/policies.ts": "Defines policy metadata types and constants for privacy, shipping, returns, terms, and marketplace policies, including display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace access (free with $5 per-sale fee) and optional Store Builder subscription ($10/month), including FAQ and marketing descriptions.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection and factory functions for Web Speech API (SpeechRecognition and SpeechSynthesis), with a TTS controller interface for managing text-to-speech operations.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays authenticated user's account overview with profile information (name, email, account creation date, active role) and navigation cards to settings, billing, and documentation sections.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payment processors, fee configuration, transactions, employee payments, user role management, marketplace roadmap, access links, role applications, accounts, sales reports, and messaging.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that initializes access control on mount, displays financial state and dashboard data with tabs for overview, payments, fees, transactions, employees, transfers, revenue, and access links.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources with commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons for each category.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Uses route params to identify the app and shows status badges.",
  "frontend/src/pages/ApplyPage.tsx": "Role application page where authenticated users can apply for Employee or Admin roles by selecting a role card and submitting a reason. Uses useSubmitRoleApplication mutation and displays toast notifications.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Business dashboard showing four card sections (B2B Services, Business Credit, Team Management, Analytics) with icons and a placeholder overview card. Requires authenticated user.",
  "frontend/src/pages/CustomerBlog.tsx": "Blog listing page displaying multiple blog posts with categories, read times, and excerpts. Shows posts about getting started, security, shopping tips, subscriptions, and support.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Individual blog post viewer that uses route params to display full post content from a hardcoded posts dictionary. Includes back navigation, category badge, and formatted content sections.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons and hover effects, plus a Recent Activity section showing a placeholder message.",
  "frontend/src/pages/CustomerFAQ.tsx": "Customer FAQ page with an accordion of frequently asked questions covering account creation, products, pricing, payments, refunds, support contact info, and the Store Builder subscription feature.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page that checks for authentication and displays a placeholder card indicating the messaging system is coming soon with inbox-style (non-real-time) messaging.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Customer purchase history page that checks for authentication and displays a placeholder card indicating order tracking and purchase history features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with voice and microphone permission controls, displaying permission status with icons, and toggles for voice activation and spoken replies features with browser support detection.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons and hover effects, plus a Recent Updates section showing a placeholder message.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing ANC Marketplace features (e-commerce, startup program, B2B services) with hero section, feature cards, and pricing information. Includes navigation to FAQ pages and displays promotional content.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static policy page displaying marketplace rules including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error messaging, common failure reasons list, and navigation buttons to retry or return to admin center.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with success messaging and navigation options to return to admin center or view transaction history.",
  "frontend/src/pages/PciCompliancePage.tsx": "PCI DSS compliance certificate display page showing certificate image with download/view options and security assurance information for ANC Electronics N More.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page outlining data collection, usage, sharing practices, security measures, and user rights with contact information.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple wrapper page that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "User registration page with role selection (seller, customer, business, marketer), Internet Identity authentication, and profile creation form with name/email fields. Handles role-based redirection after registration.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static returns policy page detailing 30-day return eligibility, non-returnable items, return process, refund timeline, and shipping responsibility information.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-filtered metrics (total earnings, orders, shipped items) using cards and icons; requires authenticated registered user.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps SellerOnboardingWizard component with authentication requirement for registered users.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog post cards covering B2B, startup, store builder, integrations, funnels, and business credit topics with navigation to individual posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post content based on postId parameter, displaying title, metadata, and multi-paragraph article content with back navigation.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays accordion-style FAQ covering B2B services, subscriptions, startup program, integrations, store builder, funnels, dropshipping, payments, team management, analytics, and support.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance, service use, account responsibilities, payments, intellectual property, liability, and contact information.",
  "frontend/src/types/index.ts": "Defines comprehensive TypeScript types for the marketplace platform including user profiles, products, orders, educational content, B2B services, dropshipping partners, app integrations, store templates, and branding assets with various enum-like variant types.",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API, including SpeechRecognition interfaces, events, and result structures for speech-to-text functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking the ANC Marketplace platform status, documenting known Admin Center backend connection issues, existing features including Stripe integration, transaction history, sales reporting, messaging system, and admin management capabilities."
}