{
  "backend/main.mo": "Main Motoko actor defining all core types (UserProfile, Product, EcomOrder, Lesson, VirtualMeeting, etc.), role-based access control, seller onboarding, policy management, payment processing, and blob storage integration for the ANC Marketplace platform.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and styles, documenting routing, dashboards, profile setup, store pages, payment flows, and UI components with their specific implementations and fixes.",
  "frontend/index.html": "Main HTML entry point with comprehensive meta tags for SEO, Open Graph, Twitter cards, PWA manifest, favicons, and iOS/Microsoft tile configurations for the ANC Marketplace application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons in multiple sizes (16x16 to 1024x1024), theme colors, display mode, and screenshots for installable web app functionality.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0, Feb 2026) outlining user responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, intellectual property rights, prohibited activities, and dispute resolution procedures.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy (Feb 2026) detailing information collection practices, usage of personal data, third-party sharing, data security measures, user rights, cookie usage, and contact information for ANC Marketplace.",
  "frontend/public/policies/returns-policy.md": "Returns policy (Feb 2026) specifying 30-day return eligibility, non-returnable items, return process steps, refund processing timeline (5-7 days), exchange procedures, and 15% restocking fee conditions.",
  "frontend/public/policies/shipping-policy.md": "Shipping policy (Feb 2026) describing shipping methods (standard/expedited/express), cost calculation, 1-2 day processing time, tracking, international shipping terms, restrictions, and procedures for lost/damaged packages.",
  "frontend/public/policies/terms-and-conditions.md": "Markdown document containing the complete Terms and Conditions for ANC Marketplace, covering user agreements, marketplace rules, payment terms, liability limitations, and dispute resolution.",
  "frontend/src/App.tsx": "Main application entry point that sets up React Router with TanStack Router, React Query client, Internet Identity provider, and defines all application routes including home, dashboards, policies, and payment pages.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Admin panel component that displays and provides copy/open functionality for app and admin URLs, plus owner contact information with clipboard integration.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin console pages with gradient background, title, subtitle, and card-based content container.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Admin panel with tabbed interface for managing manual and scheduled employee payments, currently simulated with backend integration pending.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Admin panel for configuring marketplace service fees (currently view-only at $5.00 per sale). Includes UI for fee input and save functionality, but backend integration is pending.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays three financial overview cards showing available funds, business credit (limit and used amount), and payroll savings. Formats currency values from cents to USD display.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin component for viewing and refreshing marketplace roadmap items with progress tracking, completion status, and error handling for permission issues.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Panel for processing marketplace fees and subscription charges via Stripe checkout. Includes buttons to charge sale service fees ($5.00) and store builder subscriptions, with Stripe configuration checks.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card component for owner Stripe Connect account onboarding to enable payouts. Currently shows 'Not Connected' status with placeholder functionality pending backend integration.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel that groups payment processor configuration components, including Stripe setup and owner Stripe Connect cards.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Card for configuring Stripe payment processor with secret key and allowed countries. Shows configuration status and provides form to set or update Stripe credentials.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel for reviewing pending user role applications with approve/reject actions, displaying applicant principals, requested roles, and application status in a table format.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Displays transaction history table with date, type (deposit/credit funding), amount, and status columns. Includes refresh functionality and handles loading/error states.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "A stub UI component for owner withdrawals that displays a form for amount, currency, and reason, with an alert indicating backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin dashboard component displaying user role summary statistics (admins, users, guests) in card format with loading and error states.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Main chat panel component for the AI assistant that supports multiple modes (Customer, Seller, Website/App Builder, Business Operations), integrates speech recognition and text-to-speech, and manages conversation state.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "A floating widget button that toggles the AssistantChatPanel visibility, positioned fixed at bottom-right of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Authentication guard component that checks for Internet Identity login and user profile, redirecting to login or profile setup if needed before rendering children.",
  "frontend/src/components/Footer.tsx": "Footer component displaying legal/policy links, contact information for ANC Marketplace (including EIN, address, email), admin/employee access links, and payment card icons.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with sticky header navigation, authentication controls, role-based routing logic, dropdown menus for customer/seller sections, and mobile menu support.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file placeholder for policy document display component.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file placeholder for policy signatures panel component.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file placeholder for policy signature requirement guard component.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Cookie consent banner component that displays at bottom of page, allowing users to accept or reject cookies with a link to privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for new users to complete their profile by entering full name and email, with role-based redirect logic after submission.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Authentication guard component that checks if authenticated users have a profile and redirects to profile setup if missing, while allowing public access for unauthenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Error boundary fallback UI displaying an error message with options to refresh the page or return to home when routing errors occur.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary component that catches runtime errors and unhandled promise rejections, displaying a user-friendly error UI with technical details and a refresh button.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Dialog component for human verification using a checkbox and simple math challenge before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Configuration file defining the seller onboarding steps sequence with metadata (title, description, placeholder status) and helper functions for step lookup.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "Multi-step wizard component for seller onboarding that manages progress through steps, saves state to backend, and displays navigation controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "Reusable card component for displaying placeholder seller profile sections with icon, title, description, and optional badge.",
  "frontend/src/components/startup/Activities.tsx": "Empty file placeholder for startup activities component.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file placeholder for business credit component.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file placeholder for classes and lessons component.",
  "frontend/src/components/startup/LessonDetail.tsx": "React component that displays a detailed view of a lesson with video embed, content, and a back button. Includes a 'Mark as Complete' button that is not yet functional.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission state and voice preferences (activation and spoken replies) into a unified voice settings interface. Exposes hooks for managing both microphone access and user voice preferences.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Hook providing a mutation for asking the AI assistant questions by category. Currently returns a placeholder message indicating the feature is under development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle. Includes automatic identity restoration from local storage and configurable idle/expiration handling.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Hook for managing browser microphone permissions with status tracking (prompt/granted/denied/unavailable). Provides methods to request permission, check current status, and retry failed requests.",
  "frontend/src/hooks/usePageActivity.ts": "Hook that tracks whether the page is active by monitoring visibility changes and focus/blur events. Returns a boolean indicating if the page is currently visible and focused.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data fetching and mutations including user profiles, admin checks, role applications, seller onboarding, financial data, and transactions. Manages query invalidation and caching for all backend operations.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest). Returns the redirect path and loading state.",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides hooks for fetching and saving seller onboarding progress state. Wraps backend actor calls with React Query for caching and automatic invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Hook that wraps the browser's SpeechRecognition API with React state management, supporting continuous listening, interim results, and automatic restart. Requires microphone permission and provides transcript state, error handling, and start/stop/reset controls.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a React hook for creating Stripe checkout sessions via the backend actor, redirecting users to the Stripe-hosted checkout page with success/cancel URLs.",
  "frontend/src/hooks/useTextToSpeech.ts": "React hook that wraps browser speech synthesis API to provide text-to-speech functionality with state tracking for speaking status and current message ID.",
  "frontend/src/hooks/useVoicePreferences.ts": "React hook for managing voice activation and spoken replies preferences, syncing state with localStorage via the voicePreferences utility.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color tokens for a navy blue theme, menu styling, animated gradient logo, and voice listening indicator animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for storing and retrieving cookie consent status in localStorage with a boolean value.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, used to prevent bot access.",
  "frontend/src/lib/policies.ts": "Defines metadata for legal policies (privacy, shipping, returns, terms, marketplace) including display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace ($5 per sale fee) and optional Store Builder subscription ($10/month).",
  "frontend/src/lib/voice/browserVoice.ts": "Factory functions and feature detection for Web Speech API (speech recognition and synthesis), providing a TTS controller interface.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (activation and spoken replies) in localStorage with versioning and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AccountPortalPage.tsx": "Account overview page showing user profile information (name, email, account creation date, active role) with navigation to settings and other account management features.",
  "frontend/src/pages/AdminCenterPage.tsx": "Admin dashboard with tabs for financial overview, payment processors, revenue, fees, transactions, employee payments, transfers, user roles, roadmap, and access links; includes access control initialization logic.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for financial overview, payment processors, fee configuration, transactions, employee payments, transfers, revenue inflow, and access links. Handles authentication, access control initialization, and displays loading/error states.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard displaying four placeholder cards for referral links, commission tracking, performance analytics, and marketing resources. Shows commission summary with static placeholder data.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace page displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges. Each app card shows description and status (available/coming-soon).",
  "frontend/src/pages/AppLaunchPage.tsx": "Individual app detail page showing app configuration, status, and actions (launch, configure, uninstall). Supports external app launches like ClickFunnels and displays app-specific information.",
  "frontend/src/pages/ApplyPage.tsx": "Role application page allowing authenticated users to apply for Employee or Admin roles. Includes role selection cards and a form to submit application reason.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Business dashboard page displaying a welcome header and four card sections (B2B Services, Business Credit, Team Management, Analytics) with icons and hover effects, plus a placeholder business overview section.",
  "frontend/src/pages/CustomerBlog.tsx": "Customer-facing blog listing page that displays an array of blog posts with categories, read times, and excerpts in a responsive card grid layout.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Individual blog post detail page that fetches post content by ID from a hardcoded dictionary and displays the full article with metadata (date, category, read time).",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page showing a personalized welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons and hover effects, plus a placeholder recent activity section.",
  "frontend/src/pages/CustomerFAQ.tsx": "FAQ page for customers displaying an accordion of common questions about the platform, pricing, payments, security, and services, with pricing details imported from a shared pricing model.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages/inbox page that requires authentication and displays a placeholder indicating the messaging system is coming soon (inbox-style, not real-time chat).",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Displays a placeholder page for customer purchase history and order tracking, requiring authentication and showing a 'coming soon' message until the marketplace order system is implemented.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides customer settings page with voice feature configuration (microphone permissions, voice activation, spoken replies) and displays permission status with controls to request/retry access.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard showing placeholder cards for assigned tasks, schedule, payroll, and resources with a teal/cyan gradient theme and authentication requirement.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing ANC Marketplace with hero section, three main feature cards (E-Commerce, Startup Program, B2B Services), and pricing information with navigation to relevant sections.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static policy page outlining marketplace rules including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page within admin layout displaying error reasons, no-charge confirmation, and options to return to admin center or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page within admin layout showing success message and navigation options to admin center or transaction history.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays ANC Electronics' PCI DSS compliance certificate with options to view in a new tab or download. Includes information about security standards and what compliance means for customers.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a static privacy policy page covering information collection, usage, sharing, data security, user rights, and contact information.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple wrapper page that renders the ProfileSetup component.",
  "frontend/src/pages/RegisterPage.tsx": "Multi-step registration page where users select a role (seller, customer, business, marketer), authenticate via Internet Identity, and complete profile setup with name and email.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Displays a static returns policy covering eligibility, non-returnable items, return process, refund processing, and shipping costs.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Protected seller dashboard displaying earnings summary with time frame filtering (today, week, month, all time), showing total earnings, orders, and items sold with loading and error states.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Protected page wrapper that renders the SellerOnboardingWizard component for authenticated registered users.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Blog listing page displaying business-focused articles about B2B services, startup programs, store building, integrations, sales funnels, and business credit with category badges and read times.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays individual blog posts for B2B services and startup program topics, with hardcoded content for posts like 'b2b-dashboard-guide' and 'startup-program-success'. Uses route params to select and render the appropriate post with metadata (date, category, read time).",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Renders an accordion-style FAQ page with questions and answers about B2B services, startup assistance program, store builder, payment processing, and other business features.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, and international shipping details.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions including acceptance of terms, use of service, account responsibilities, payments, intellectual property, and liability limitations.",
  "frontend/src/types/index.ts": "Defines TypeScript types and interfaces for the entire application including user roles, access roles, products, orders, startup program data, B2B services, dropshipping partners, app integrations, and store builder configurations. Includes helper functions for AccessRole variants.",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API, including SpeechRecognition interfaces, events, and result types for browser speech recognition functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom box shadows, and accordion animation keyframes.",
  "project_state.json": "Project state tracking document indicating the Admin Center has a backend initialization hang issue where the frontend successfully authenticates but the backend access control initialization doesn't complete, leaving the UI stuck on 'Connecting to backend...'."
}