{
  "backend/main.mo": "Defines the main canister actor with types for policies, users, products, orders, educational content, and startup program data, plus comparison helpers and storage mixins.",
  "backend/migration.mo": "Adds a new policySignaturesByUser map during migration while preserving existing state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file for build planning.",
  "frontend/index.html": "HTML entry point defining metadata, icons, PWA manifest link, and bootstrapping the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, icons, colors, categories, and screenshots.",
  "frontend/public/policies/privacy-policy.md": "Full privacy policy detailing data collection, usage, rights, cookies, and contact info.",
  "frontend/public/policies/returns-policy.md": "Detailed returns policy covering eligibility, exclusions, process, refunds, and contact info.",
  "frontend/public/policies/shipping-policy.md": "Shipping policy outlining methods, costs, processing, tracking, international rules, and contact info.",
  "frontend/public/policies/terms-and-conditions.md": "Outlines platform terms including user obligations, marketplace rules, payments, liability limits, dispute resolution, and account termination policies.",
  "frontend/src/App.tsx": "Sets up the app's router, query client, and page routes for all major site sections including policies, blogs, FAQs, and settings.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Provides UI to view, search, add, and edit assistant knowledge base entries with modal dialogs and mutation hooks.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Lists unanswered questions and allows converting them into knowledge base entries via a dialog workflow.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Displays and refreshes marketplace roadmap data with progress tracking and error handling using admin dashboard queries.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Shows counts of user roles with loading and permission error states using role summary data.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Implements the main assistant chat interface with text input, speech recognition, text‑to‑speech, and multi‑mode conversation handling.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Renders a floating button that opens a chat widget containing the AssistantChatPanel.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with legal links, contact information, and accepted payment methods and partners.",
  "frontend/src/components/Layout.tsx": "Provides the global layout including header navigation, login handling, banner, mobile menu, and wrapped content output.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Loads and renders markdown policy content, showing metadata, errors, and signature alerts based on user identity.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "UI for reviewing and signing policies, managing acceptance state and submitting signatures to the backend.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Checks whether all required policies are signed and blocks access with a prompt if any remain unsigned.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Displays a cookie consent banner and stores the user's accept or reject choice.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for creating a user profile, saving name and email via backend mutation with validation and toast feedback.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays an error screen for route-related issues with a link back to the home page.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Catches runtime errors and shows a fallback UI with error details and a refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog that verifies the user is human via a checkbox and simple math challenge before continuing.",
  "frontend/src/components/startup/Activities.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty placeholder component.",
  "frontend/src/components/startup/LessonDetail.tsx": "Shows lesson details with video, HTML content, and controls to navigate back or mark completion.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty placeholder component.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Provides microphone permission state and voice preference settings through a React context.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating queries when identity changes.",
  "frontend/src/hooks/useAssistant.ts": "Mutation hook that sends questions to the backend assistant via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Manages microphone permission state, checking browser support and requesting access via getUserMedia.",
  "frontend/src/hooks/usePageActivity.ts": "Tracks whether the page is active based on visibility and window focus events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods for roles, admin data, and related mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser speech recognition, handling start/stop, results, errors, and permission-aware behavior.",
  "frontend/src/hooks/useTextToSpeech.ts": "Provides text‑to‑speech controls using SpeechSynthesis, tracking speaking state and current message.",
  "frontend/src/hooks/useVoicePreferences.ts": "Manages persisted user voice settings with getters and setters tied to localStorage.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and UI utility classes.",
  "frontend/src/lib/cookieConsent.ts": "Handles reading and writing cookie consent status to localStorage.",
  "frontend/src/lib/humanCheck.ts": "Implements a session‑based human verification flag with a 30‑minute TTL.",
  "frontend/src/lib/policies.ts": "Defines policy identifiers and metadata for privacy, shipping, returns, and terms pages.",
  "frontend/src/lib/pricingCopy.ts": "Defines centralized pricing copy and store builder pricing details for the platform.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides browser speech recognition and text-to-speech support utilities.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preference settings using localStorage with versioning.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminDashboard.tsx": "Placeholder page with no content.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Placeholder page with no content.",
  "frontend/src/pages/AppCenterPage.tsx": "Placeholder page with no content.",
  "frontend/src/pages/AppLaunchPage.tsx": "Placeholder page with no content.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Placeholder page with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Placeholder page with no content.",
  "frontend/src/pages/CustomerBlog.tsx": "Displays a grid of customer blog posts with previews and navigation to full posts.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders full blog post content based on route params.",
  "frontend/src/pages/CustomerFAQ.tsx": "Shows customer FAQs using accordion components with pricing-based answers.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Placeholder page with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Authenticated page showing a placeholder inbox for upcoming messaging features.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Placeholder page with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Authenticated page showing a placeholder for future purchase history and tracking.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Settings page handling identity checks, voice permissions, and policy signatures display.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing business features, hero section, and navigation to key service areas.",
  "frontend/src/pages/PaymentFailure.tsx": "Empty page file intended to show payment failure state.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty page file intended to show payment success state.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI compliance certificate details with view and download options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy document using shared policy components.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Renders the returns policy document via shared policy renderer.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Lists multiple business blog posts with categories, excerpts, and navigation to full posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays full blog post content based on route params with navigation back to blog list.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Renders a FAQ page for B2B services using accordion UI components with predefined questions and answers.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Displays the shipping policy by loading a markdown file through the PolicyDocument component.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty placeholder page with no content defined.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty placeholder page intended for store builder functionality.",
  "frontend/src/pages/StorePage.tsx": "Empty placeholder page for storefront or product listing features.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the terms and conditions policy via the PolicyDocument component referencing a markdown file.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces and enums for users, products, orders, lessons, meetings, activities, business data, integrations, and store builder configuration.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript definitions for the Web Speech API including SpeechRecognition and related event types.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project metadata, requirements, features, and compliance-related notes for the ANC Electronics web app."
}