{
  "backend/main.mo": "Defines core backend data types for users, products, orders, educational content, business credit, carts, partners, integrations, and B2B services with comparison utilities and storage mixin.",
  "feature_evidence.json": "Aggregates feature evidence entries mapping features to relevant source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React components, pages, and hooks.",
  "frontend/index.html": "HTML entrypoint defining metadata, SEO tags, icons, and root mount point for the frontend app.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, theming, icons, categories, and screenshots.",
  "frontend/src/App.tsx": "Main React app router configuring all routes, query client, theme provider, and identity provider wrapper.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Admin tool to view, add, edit, delete, and toggle knowledge base entries for the assistant.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Admin view listing unanswered assistant questions and allowing conversion into knowledge base entries.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin panel that loads and displays marketplace roadmap data with progress tracking and a manual refresh option.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Admin interface for viewing users, filtering, and assigning roles through dialogs and update mutations.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "User chat interface for interacting with the assistant, handling message flow, responses, and escalation prompts.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating assistant button that opens a chat panel containing the AssistantChatPanel component.",
  "frontend/src/components/Layout.tsx": "Global layout with header, footer, navigation, admin quick-access links, auth handling, and responsive mobile menu.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Displays a cookie consent banner with accept, reject, and privacy policy navigation options based on stored consent state.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile by submitting name and email using a mutation and displaying toast notifications.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Dialog requiring a checkbox and simple math question to verify the user before continuing.",
  "frontend/src/components/startup/Activities.tsx": "Fetches and displays user startup activities with progress tracking and completion actions.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Shows business credit progress and allows updating verification and bureau registration statuses.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Displays user lessons, progress, and allows selecting a lesson to view details.",
  "frontend/src/components/startup/LessonDetail.tsx": "Renders detailed lesson view with video, content, and options to mark complete or go back.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Displays a user's upcoming and past virtual meetings using data from a query hook, with cards for joining or viewing details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook that sends questions to the backend assistant via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Contains various React Query hooks for admin actions, user profiles, and backend operations, handling auth and query invalidation.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, color variables, dark mode themes, and animated gradient text effects.",
  "frontend/src/lib/cookieConsent.ts": "Manages cookie consent status using localStorage with helpers to get, set, and check if consent should be shown.",
  "frontend/src/lib/humanCheck.ts": "Implements a session-based human verification flag with TTL-based expiration and helper functions.",
  "frontend/src/lib/pricingCopy.ts": "Provides centralized pricing details and marketing copy for the platform and store builder subscription.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed sections for settings, user roles, knowledge base, unanswered questions, and roadmap, including Stripe setup and access control actions.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard showing placeholder referral and commission stats, milestones, and login gating.",
  "frontend/src/pages/AppCenterPage.tsx": "App integrations manager allowing users to list, add, edit, and delete webhook‑based app integrations with dialog-driven forms.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Page embedding a Calendly scheduler and providing appointment booking info for the ANC Apprentice Program Center.",
  "frontend/src/pages/B2BDashboard.tsx": "B2B dashboard gated by membership, showing quick links and placeholder metrics for projects, clients, and revenue.",
  "frontend/src/pages/CustomerBlog.tsx": "Customer blog listing static posts with categories, excerpts, dates, and navigation to full articles.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Displays a full blog post based on the postId URL param, rendering predefined content and a back button.",
  "frontend/src/pages/CustomerFAQ.tsx": "Shows a list of customer FAQs using an accordion, including pricing info pulled from PRICING_MODEL.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Fetches and displays the user's favorite sellers, with options to remove favorites and login gating.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Provides a placeholder messages inbox for customers, gated behind login, noting messaging is coming soon.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Displays the customer profile dashboard with quick links to store, favorites, settings, and other features.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Shows a purchase history page placeholder for logged‑in users, indicating order tracking is coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Provides a settings dashboard with sections for profile, privacy, notifications, and account, mostly placeholders.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Displays the user's wishlist, handles login gating, loads saved item IDs, and allows removing items with feedback.",
  "frontend/src/pages/FunnelsPage.tsx": "Shows and manages marketing funnel partner configuration with admin controls, URL validation, and modal editing.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content and feature cards linking to store-related pages.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Processes payment success via query params, updates subscription status, and redirects or shows errors.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI compliance certificate info with preview, open-in-new-tab, and download options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a scrollable privacy policy page with sections on data collection, usage, and disclosure. Uses UI components to structure headings, text, and separators.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog posts for sellers and businesses with categories, read times, and navigation links. Uses cards and badges to present post summaries.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Shows a full blog post based on the URL parameter, pulling content from a predefined posts object. Includes navigation back and metadata like date, category, and read time.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Provides an accordion-style FAQ page covering B2B services, startup program features, integrations, and payments. Uses UI components to organize questions and answers.",
  "frontend/src/pages/StartupDashboard.tsx": "Displays the startup program dashboard with progress metrics and tabs for lessons, meetings, activities, and credit building, gated by membership and login checks.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Implements the store builder UI, handling template selection, branding customization, subscription flow, and saving configuration via query hooks.",
  "frontend/src/pages/StorePage.tsx": "Displays available products, manages checkout sessions with human verification, and handles authenticated purchasing.",
  "frontend/src/types/index.ts": "Defines shared frontend TypeScript types for users, products, orders, services, store templates, branding, and related domain models.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Describes current project metadata, implemented features, and roadmap state for development tracking."
}