{
  "backend/main.mo": "Defines core backend actor with types for users, products, orders, education content, business data, and integrations, plus comparison utilities for sorting.",
  "feature_evidence.json": "Lists feature evidence for navigation updates and privacy policy link, mapping related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files including routes, components, dashboards, and styling.",
  "frontend/index.html": "Static HTML entry point defining metadata, icons, PWA settings, and root mounting point for the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app name, theme, icons, categories, and screenshots.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes, pages, authentication flow, and theme/toast providers.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Admin tool for managing assistant knowledge base entries, allowing creation, editing, activation toggling, and deletion.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Displays unanswered assistant queries and allows admins to convert them into knowledge entries or mark them as answered.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Provides an admin interface for viewing users, filtering, and assigning system and access roles through dialog-driven updates.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Implements the assistant chat interface handling message exchange, API queries, typing state, and escalation prompts.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget that toggles the assistant chat panel open or closed.",
  "frontend/src/components/Layout.tsx": "Application layout providing header navigation with role-based dropdowns, mobile menu, user controls, cookie banner, and assistant widget.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Shows a cookie consent banner letting users accept or reject cookies and navigate to the privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a profile setup form that saves a user's full name and email using a mutation hook and displays toast notifications.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog with a checkbox and simple math challenge to verify the user is human before continuing an action.",
  "frontend/src/components/startup/Activities.tsx": "Displays a list of startup activities, tracks completion progress, and allows marking tasks as complete.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Shows business credit progress and lets users update verification and credit bureau registration statuses.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Lists user lessons with progress tracking and allows navigating into a selected lesson's details.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays full lesson details including video, HTML content, and controls for completion and navigation.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Shows upcoming and past virtual meetings with join links and scheduling info.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a React Query mutation that calls actor.askAssistant with a question and category.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider to manage authentication state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple placeholder React Query hooks for user profiles, roles, and other backend calls, many not yet implemented.",
  "frontend/src/index.css": "Sets up Tailwind layers, custom CSS variables, light/dark themes, and utility component styles including gradients and animations.",
  "frontend/src/lib/cookieConsent.ts": "Manages cookie consent state using localStorage with helpers to get, set, and determine if consent should be shown.",
  "frontend/src/lib/humanCheck.ts": "Handles a TTL-based human verification flag stored in sessionStorage with functions to get, set, and clear the status.",
  "frontend/src/lib/pricingCopy.ts": "Contains structured pricing model text and Store Builder pricing details for display across the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks admin status, configures Stripe settings, and provides access to various admin tools.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Renders an affiliate dashboard with placeholder referral and commission data and alerts users if backend integration or authentication is missing.",
  "frontend/src/pages/AppCenterPage.tsx": "Provides UI for viewing, adding, editing, deleting, and converting webhook-based app integrations, gated by Internet Identity auth.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Displays a scheduling page with an embedded Calendly iframe and links for booking appointments with the ANC Apprentice Program Center.",
  "frontend/src/pages/B2BDashboard.tsx": "Shows a B2B dashboard with quick links and placeholder metrics, restricting access to authenticated users with a B2B membership role.",
  "frontend/src/pages/CustomerBlog.tsx": "Lists customer-focused blog posts with metadata and navigation links to full post pages.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders full content for a selected customer blog post based on the route parameter, including metadata and multi-paragraph text.",
  "frontend/src/pages/CustomerFAQ.tsx": "Displays a customer FAQ page using accordion components and dynamic pricing text from PRICING_MODEL.",
  "frontend/src/pages/FunnelsPage.tsx": "Provides UI for viewing and configuring a merchant’s marketing funnel partner, with admin-only editing and URL validation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content and feature cards linking to store-related services.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Processes Stripe payment results, activates plans or subscriptions, and redirects users based on plan type.",
  "frontend/src/pages/PciCompliancePage.tsx": "Displays PCI DSS compliance info with certificate preview, open-in-tab, and download actions.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a scrollable privacy policy page with sections outlining data collection and usage. Uses UI components to structure headings, paragraphs, and lists.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a blog listing page showing multiple posts with categories, excerpts, and metadata. Includes navigation to individual blog posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders full blog post content based on the postId route param. Stores blog articles in a local record and displays metadata and text sections.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Provides an FAQ page with accordion items covering B2B services, startup features, integrations, payments, and support. Uses UI components for structured Q&A display.",
  "frontend/src/pages/StartupDashboard.tsx": "Implements the Startup Program dashboard with membership checks, progress cards, and tabbed sections for lessons, meetings, activities, and credit building. Redirects or alerts users without proper access.",
  "frontend/src/pages/StoreBuilderPage.tsx": "React page for configuring store templates and branding, handling subscription checkout and saving store builder settings.",
  "frontend/src/pages/StorePage.tsx": "Product listing and checkout page with human verification gating, allowing authenticated users to buy items.",
  "frontend/src/types/index.ts": "Central TypeScript type definitions for users, products, orders, store templates, customization, and integrations.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, containers, animations, and plugin setup.",
  "project_state.json": "Project metadata describing features, requirements, architectural notes, and known issues for ANC Marketplace."
}