{
  "backend/main.mo": "Defines core backend types for policies, users, products, orders, educational content, and startup program data, including comparison logic and storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a light‑theme requirement to specific frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend components and pages.",
  "frontend/index.html": "HTML document bootstrapping the React app with metadata, PWA tags, and asset links.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, and screenshots for installation.",
  "frontend/public/policies/privacy-policy.md": "Markdown privacy policy detailing data collection, usage, rights, and contact information.",
  "frontend/public/policies/returns-policy.md": "Markdown returns policy explaining eligibility, process, refunds, and non-returnable items.",
  "frontend/public/policies/shipping-policy.md": "Markdown shipping policy describing methods, costs, processing times, and delivery conditions.",
  "frontend/public/policies/terms-and-conditions.md": "Markdown document outlining ANC platform terms including user responsibilities, marketplace rules, payments, liability, dispute resolution, and modification rights.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, React Query client, theme provider, and global error boundaries.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Manages assistant knowledge base entries, including search, add, edit, and category-based flagging.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Displays unanswered questions and allows converting them into knowledge base entries with category assignment.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Displays admin marketplace roadmap data with progress, refresh capability, and error/permission handling.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Shows user role summary counts with error handling and loading states for admin role management.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Provides full chat UI for the assistant with messaging, mode selection, speech recognition, TTS, and voice activation.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget that toggles and displays the assistant chat panel.",
  "frontend/src/components/Footer.tsx": "Footer component showing legal links, contact details, accepted payments, and partners.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing header navigation, login/logout logic, banner, assistant widget, and global page structure.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Fetches and renders markdown-based policy content, showing loading, error, and signature status cues.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Displays all policies with UI to accept and sign them, managing signature state and backend submission.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Blocks access to children until all required policies are signed, showing a prompt with unsigned items.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Shows a cookie consent banner until the user accepts or rejects, storing the preference in local storage.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form allowing users to submit name and email and save their profile via a backend mutation.",
  "frontend/src/components/RouterErrorScreen.tsx": "Fallback UI for route-level errors with message and link back to home.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors and displays a refresh prompt with optional error details.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "Modal dialog requiring a checkbox and simple math challenge to verify a human before proceeding.",
  "frontend/src/components/startup/Activities.tsx": "Empty placeholder file for startup activities UI.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty placeholder file for business credit UI.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty placeholder file for classes/lessons UI.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays a lesson’s details, embedded video, HTML content, and completion/back controls.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty placeholder file for virtual meetings UI.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "Provides microphone permission state and voice preference controls through a React context.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook to ask the backend assistant a question via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity login state using AuthClient, including loading, login, logout, and status flags.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Manages microphone permission status, checks browser support, and provides functions to request or retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Tracks whether the page is currently active based on visibility and focus events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods for roles, dashboard data, partners, and policies.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser speech recognition with state management, transcript handling, error reporting, and optional auto-restart.",
  "frontend/src/hooks/useTextToSpeech.ts": "Manages text-to-speech playback, tracking speaking state and controlling speech start, stop, and cancel.",
  "frontend/src/hooks/useVoicePreferences.ts": "Loads and updates voice-related user preferences stored in localStorage.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, dark mode variables, and custom animations for UI elements.",
  "frontend/src/lib/cookieConsent.ts": "Handles reading, writing, and checking stored cookie consent status in localStorage.",
  "frontend/src/lib/humanCheck.ts": "Implements session-based human verification tracking with a TTL and helpers to set, clear, and evaluate status.",
  "frontend/src/lib/policies.ts": "Defines policy metadata and exports structured identifiers and a list of all policy definitions.",
  "frontend/src/lib/pricingCopy.ts": "Defines centralized pricing model text and Store Builder pricing data used across the app.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides Web Speech API feature checks and factories for speech recognition and speech synthesis controllers.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages localStorage-backed user voice preferences with versioning and update helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty placeholder page for the admin dashboard.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Empty placeholder page for the affiliate dashboard.",
  "frontend/src/pages/AppCenterPage.tsx": "Empty placeholder page for the app center.",
  "frontend/src/pages/AppLaunchPage.tsx": "Empty placeholder page for app launch functionality.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty placeholder page for the appointment dashboard.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty placeholder page for the B2B dashboard.",
  "frontend/src/pages/CustomerBlog.tsx": "Renders a customer blog overview with a grid of blog post cards and navigation to individual posts.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Displays full content for a selected customer blog post using route params.",
  "frontend/src/pages/CustomerFAQ.tsx": "Shows an FAQ list for customers, including pricing answers sourced from PRICING_MODEL.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty placeholder page for customer favorites.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Displays a login-gated messages page with a placeholder inbox for future messaging features.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty placeholder page for the customer profile home.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Displays a login-gated purchase history page with a placeholder for future order tracking.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Renders the customer settings UI with identity checks, voice permissions, and policy signatures management.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty page placeholder for customer wishlist functionality.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty page placeholder for sales funnel features.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content and feature cards linking to service sections.",
  "frontend/src/pages/PaymentFailure.tsx": "Empty page placeholder for payment failure messaging.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty page placeholder for payment success confirmation.",
  "frontend/src/pages/PciCompliancePage.tsx": "Shows PCI compliance certificate details with viewing and download options.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Loads and displays the privacy policy using a shared policy component.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Loads and displays the returns policy using a shared policy component.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Lists business-related blog posts with categories, excerpts, and navigation links.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Displays full blog post content based on the dynamic postId parameter.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Renders a FAQ page for B2B and startup services using accordions and cards with predefined questions and answers.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Displays the shipping policy by loading a markdown document through the PolicyDocument component.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty page placeholder for a startup dashboard.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty page placeholder for the Store Builder feature.",
  "frontend/src/pages/StorePage.tsx": "Empty page placeholder for the Store page.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the terms and conditions by loading a markdown document through the PolicyDocument component.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces and enums for users, products, orders, educational content, services, integrations, and store builder configurations.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript definitions for the Web Speech API, including SpeechRecognition and related events.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing site background issues, feature requests, and current project state."
}