{
  "backend/main.mo": "Main backend actor defining types (SellerOnboardingStep, UserRole, Product, EcomOrder, Lesson, VirtualMeeting, etc.) and including MixinStorage for blob storage functionality. Contains type definitions for user profiles, role applications, payment status, order management, and policy tracking with signature records.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: updating the Available Balance display from $10,000.00 to $72,025.00 and keeping the $10,000 credit line separate as non-withdrawable spending credit, both targeting FinancialOverviewCards.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with TanStack Router setup, query hooks, layout components, dashboard pages (startup, B2B, admin), payment success/failure pages, and various feature-specific components with corrected imports and type references.",
  "frontend/index.html": "HTML entry point with comprehensive meta tags for SEO, Open Graph, Twitter cards, PWA manifest, and app icons for ANC Marketplace branded as 'All in One Business Platform'.",
  "frontend/public/manifest.json": "PWA manifest defining ANC Marketplace as a standalone app with multiple icon sizes (16x16 to 1024x1024), business/productivity/shopping categories, and wide-format screenshot configuration.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document (v1.0, Feb 2026) outlining user responsibilities, $5 per-sale service fee, $10/month Store Builder option, payment processing, intellectual property rights, dispute resolution, prohibited activities, and liability limitations.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy (Feb 2026) detailing personal information collection, usage for order processing and support, third-party sharing with payment processors (Authorize.net, Zen dash), data security measures, user rights, and cookie usage.",
  "frontend/public/policies/returns-policy.md": "Returns policy (Feb 2026) specifying 30-day return window for unused items in original packaging, non-returnable items (digital/custom products), return process, refund timeline (5-7 business days), 15% restocking fee conditions, and damaged item procedures.",
  "frontend/public/policies/shipping-policy.md": "Markdown document detailing shipping methods, costs, processing times, tracking, international shipping, restrictions, and contact information for ANC Electronics N More and ANC Marketplace.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions covering user eligibility, account registration, prohibited activities, marketplace seller/buyer responsibilities, service fees, payment processing, liability limitations, dispute resolution, and contact information.",
  "frontend/src/App.tsx": "Main application entry point that sets up React Query, Internet Identity provider, TanStack Router with all route definitions (home, admin, dashboards, policies, blogs, FAQs, payment flows), error boundaries, and toast notifications.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Renders a searchable table of all user accounts with profile details, roles, balances, and registration dates. Includes filtering, refresh functionality, and role-based badge styling.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying admin and app URLs with copy-to-clipboard and open-in-new-tab functionality, plus owner email contact information.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages providing a gradient background, container structure, title/subtitle header, and card-styled content area.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "Dropdown menu component with grouped admin actions (user management, marketplace oversight, financial reports, system settings) that currently show 'coming soon' toasts.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Displays sales analytics metrics (total revenue, sales, pending/failed payments, total transactions) as a grid of cards with icons and formatted currency values.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Main sales analytics dashboard that fetches admin center analytics data and renders SalesMetricsCards with detailed performance metrics. Includes refresh functionality and error handling.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file placeholder for assistant knowledge base admin functionality.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file placeholder for unanswered questions admin functionality.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Provides UI for manual and scheduled employee payment tracking with tabs, forms for payee/amount/notes, and cadence selection. Backend integration is pending (simulated functionality).",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Displays marketplace service fee configuration interface with a disabled input field for per-sale fees. Currently view-only with backend integration pending.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays four financial overview cards showing available balance, total deposited (with breakdown by deposit method), business credit usage, and payroll savings. Fetches transaction history and formats currency values from cents to USD.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin panel displaying marketplace development roadmap with progress tracking, completion status badges, and refresh functionality using custom hooks for data fetching.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Admin messaging panel component that displays a placeholder UI for a future messaging system with a \"coming soon\" alert. Shows planned features like sending messages, viewing threads, filtering by user type, and searching messages.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Message composer component with form fields for recipient selection, subject, and message body. Handles message composition and validation before sending via callback prop.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a conversation thread with messages between admin and a recipient, showing message history with avatars and timestamps. Includes a reply textarea and send functionality.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Revenue collection panel that creates Stripe checkout sessions for marketplace sale fees and store builder subscriptions. Checks if Stripe is configured before allowing payment processing.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card component for owner Stripe Connect account setup showing \"Not Connected\" status. Displays alert that backend integration is pending for onboarding and payout functionality.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel for payment processor configuration that includes StripeSetupCard and OwnerStripeConnectCard components. Provides UI for configuring marketplace payment processing.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Card component for configuring Stripe payment processor with secret key and allowed countries, displaying configuration status and providing update functionality.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Admin panel for reviewing pending role applications with approve/reject actions, displaying applicant principals, requested roles with color-coded badges, and table-based layout.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying all transaction history in a table with filtering, formatting for currency/dates, status badges, and refresh functionality.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Stub component for owner withdrawals showing a form for amount, currency, and reason with a warning that backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Displays user role summary statistics (admin, user, guest counts) in card format using data from useGetUserRoleSummary hook. Includes loading and error states.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat panel component with multi-mode assistant (Customer, Seller, Website Builder, Business Operations) supporting text input, speech recognition, text-to-speech, and voice activation.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Fixed-position floating button widget that toggles the AssistantChatPanel open/closed in the bottom-right corner.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Authentication guard component that checks for Internet Identity login and user profile, redirecting to login or profile setup if needed before rendering children.",
  "frontend/src/components/Footer.tsx": "Footer component displaying legal/policy links, contact information for ANC Marketplace (including EIN, address, email, phone), admin/employee access links, and payment card icons.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header navigation, authentication controls, role-based routing logic, dropdown menus for Customer and Sellers/Businesses sections, mobile menu support, and footer integration.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file with no content.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file with no content.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file with no content.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed-position banner component that displays cookie consent request with accept/reject buttons and link to privacy policy, using local storage for persistence.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component for new users to complete their profile by entering full name and email, with role-based redirect logic after successful profile creation.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Authentication guard component that redirects authenticated users without profiles to profile setup, shows loading state during profile fetch, and allows public access for unauthenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Displays a full-screen error UI for routing failures with options to refresh the page or navigate home using Tanstack Router and Lucide icons.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections, displaying a detailed error screen with refresh option.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that implements human verification with a checkbox and simple math challenge (7+3) before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for six seller onboarding steps (signup, company details, terms, website integration, store setup, marketing) with helper functions to find steps by ID or index.",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step wizard component for seller onboarding that manages progress through steps, saves state to backend, and displays progress with navigation controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays placeholder content with an icon, title, description, and optional badge (defaults to 'Coming Soon').",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays detailed lesson content with embedded video, HTML content, and buttons to mark complete or return to lesson list.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category, currently returning a placeholder message about feature development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider that manages login state, identity persistence, delegation validity, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Hook that manages microphone permission state (prompt/granted/denied/unavailable), checks browser support, and provides functions to request and retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Hook that tracks whether the page is active by monitoring document visibility and window focus/blur events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend actor calls including user profiles, admin checks, role management, seller onboarding, Stripe configuration, transactions, earnings, and admin analytics. Includes mutations for initialization, profile updates, and role applications.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Custom hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks for fetching and saving seller onboarding progress, with the save mutation currently stubbed as not yet implemented.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for speech-to-text functionality with support for continuous listening, interim results, error handling, and automatic restart on end.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create a Stripe checkout session via the backend actor and redirects the user to the Stripe-hosted checkout page.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the Web Speech Synthesis API, managing speaking state and providing speak, stop, and cancel controls.",
  "frontend/src/hooks/useVoicePreferences.ts": "Custom hook for managing voice activation and spoken replies preferences, syncing state with localStorage via the voicePreferences utility.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom OKLCH color tokens for a navy blue theme, menu surface styling, animated gradient logo, and voice listening indicator animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent state in localStorage, including getting, setting, and checking consent status.",
  "frontend/src/lib/humanCheck.ts": "Utility functions for managing human verification status in sessionStorage with a 30-minute TTL, including verification, status checks, and clearing.",
  "frontend/src/lib/policies.ts": "Defines policy metadata types and constants for privacy, shipping, returns, terms, and marketplace-wide policies with display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace access (free with $5 per-sale fee) and optional Store Builder subscription ($10/month), including FAQ text.",
  "frontend/src/lib/voice/browserVoice.ts": "Feature detection and factory functions for Web Speech API, providing SpeechRecognition instance creation and a TTS controller interface for text-to-speech operations.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays user account overview with profile information (name, email, creation date, role) and navigation cards for settings, billing, documents, and support.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payments, fees, transactions, employees, transfers, user roles, marketplace roadmap, access links, role applications, accounts, sales reports, and messaging with error handling and auto-retry logic.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that initializes access control, handles authentication checks, and displays financial overview with tabs for payments, fees, transactions, employees, transfers, and revenue inflow.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources with commission summary section.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace page displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Includes status badges and navigation back to App Center.",
  "frontend/src/pages/ApplyPage.tsx": "Role application form allowing authenticated users to apply for Employee or Admin roles with a reason field. Submits applications via useSubmitRoleApplication hook.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Business dashboard showing four card sections (B2B Services, Business Credit, Team Management, Analytics) with placeholder content for business metrics and activity.",
  "frontend/src/pages/CustomerBlog.tsx": "Blog listing page displaying five hardcoded blog posts with categories, read times, and excerpts. Each post card links to detailed post view.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Individual blog post viewer that displays full content for posts by ID, including getting-started and security tips with multi-paragraph content arrays.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons and hover effects, plus a Recent Activity section showing a placeholder message.",
  "frontend/src/pages/CustomerFAQ.tsx": "Customer FAQ page with an accordion of frequently asked questions covering account creation, products, pricing, payments, refunds, support contact, and Store Builder subscription details.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page that requires authentication and displays a placeholder indicating the messaging system is coming soon with inbox-style (non-real-time) messaging.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Customer purchase history page that requires authentication and displays a placeholder indicating order tracking and purchase history features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with voice and microphone permission controls, including toggles for voice activation and spoken replies, with permission status display and browser compatibility checks.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons and hover effects, plus a Recent Updates section showing a placeholder message.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying ANC Marketplace hero section, three feature cards (E-Commerce, Startup Program, B2B Services), and a pricing section with subscription tiers and payment options.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static page displaying marketplace policies including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error icon, common failure reasons list, and buttons to return to admin center or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with success icon and navigation options to return to admin center or view transaction history.",
  "frontend/src/pages/PciCompliancePage.tsx": "Page displaying PCI DSS compliance certificate (certificate #02202604883801) with preview image, download/view buttons, and security benefits explanation.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page covering information collection, usage, sharing, data security, user rights, and contact information.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple wrapper page that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with role selection (Seller, Customer, Business, Marketer), Internet Identity authentication, and profile creation form with name and email fields.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static returns policy page detailing 30-day return eligibility, non-returnable items, return process, refund timeline, and shipping responsibility.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-filtered metrics (total earnings, orders, items sold) using cards and icons; includes loading/error states and requires authenticated registered user.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps the SellerOnboardingWizard component with authentication requirement for registered users.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog post cards for sellers/businesses covering topics like B2B dashboard, startup program, store builder, integrations, sales funnels, and business credit.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post content with navigation back to blog list; includes hardcoded post data for multiple business-related articles.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays accordion-style FAQ page answering questions about B2B services, startup assistance, store builder, integrations, payments, analytics, and support for business users.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details in a card layout.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance, service use, account responsibilities, payments, intellectual property, liability limitations, and contact information.",
  "frontend/src/types/index.ts": "Defines comprehensive TypeScript types for the ANC Marketplace frontend including user profiles, products, orders, educational content, business services, integrations, store customization, and role management.",
  "frontend/src/types/speech.d.ts": "Provides TypeScript type definitions for the Web Speech API (SpeechRecognition) including event handlers, results, and browser-specific implementations (webkit).",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom color scheme using OKLCH color space, extended shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for ANC Marketplace with Stripe integration, documenting architectural decisions, known build issues, balance display problems ($72,025 vs $10,000), and pending feature requests for payout functionality."
}