{
  "backend/main.mo": "Main backend actor defining all data types (user roles, products, orders, lessons, meetings, policies, onboarding, payments) and business logic including user management, role applications, financial transactions, Stripe integration, product/order management, and blob storage for file uploads.",
  "feature_evidence.json": "Feature evidence report documenting five features related to fixing Admin Center backend connection issues and restoring dashboard functionality after Internet Identity authentication was added, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including pages (dashboards, store, admin), components (layout, profile setup, startup modules, admin sections), hooks (useQueries for backend operations), and styling with role-based navigation and authentication flows.",
  "frontend/index.html": "HTML entry point with comprehensive meta tags for SEO, Open Graph, Twitter cards, PWA configuration, favicon links, and iOS/Microsoft tile settings for ANC Marketplace branding.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons in multiple sizes (16x16 to 1024x1024), display mode, orientation, and screenshots for ANC Marketplace progressive web app installation.",
  "frontend/public/policies/marketplace-policy.md": "Marketplace policy document outlining user responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, intellectual property rights, prohibited activities, dispute resolution, and liability limitations for the ANC Marketplace platform.",
  "frontend/public/policies/privacy-policy.md": "Privacy policy detailing information collection practices, data usage, third-party sharing (payment processors, service providers), security measures, user rights (access, correction, deletion), cookie usage, and contact information for privacy inquiries.",
  "frontend/public/policies/returns-policy.md": "Markdown document detailing the returns policy including 30-day return eligibility, non-returnable items, return process steps, refund processing timelines, restocking fees, and contact information for ANC Electronics N Services.",
  "frontend/public/policies/shipping-policy.md": "Markdown document outlining shipping methods (standard, expedited, express), costs, processing times, tracking, international shipping terms, delivery restrictions, and procedures for lost or damaged packages.",
  "frontend/public/policies/terms-and-conditions.md": "Comprehensive terms and conditions document covering user eligibility, account registration, prohibited activities, marketplace seller/buyer responsibilities, service fees ($5 per sale, $10/month Store Builder), payment processing, liability limitations, and dispute resolution governed by Florida law.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router with all route definitions, QueryClient configuration, InternetIdentity provider, error boundaries, and renders the Layout wrapper with Toaster notifications.",
  "frontend/src/components/admin/AccessLinksPanel.tsx": "Empty file with no content.",
  "frontend/src/components/admin/accounts/AllAccountsPanel.tsx": "Renders a searchable table of all registered users with their profiles, roles, balances, and registration dates, using useGetAllUsers hook with refresh functionality.",
  "frontend/src/components/admin/AdminAccessLinksPanel.tsx": "Card component displaying admin access links (app URL, admin URL) and owner email with copy-to-clipboard and open-in-new-tab functionality using toast notifications.",
  "frontend/src/components/admin/AdminConsoleLayout.tsx": "Layout wrapper component for admin pages with gradient background, title, optional subtitle, and bordered content container.",
  "frontend/src/components/admin/AdminDropdownMenu.tsx": "Dropdown menu component with grouped admin actions (user management, marketplace oversight, financial reports, system settings) that shows 'Coming Soon' toasts when clicked.",
  "frontend/src/components/admin/analytics/SalesMetricsCards.tsx": "Displays a grid of metric cards showing total revenue, sales counts, pending/failed payments, and total transactions with formatted currency and color-coded icons.",
  "frontend/src/components/admin/analytics/SalesReportsPanel.tsx": "Main analytics panel that fetches admin center analytics data and renders SalesMetricsCards with loading, error, and refresh states.",
  "frontend/src/components/admin/assistant/AssistantKnowledgeBaseAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/assistant/UnansweredQuestionsAdmin.tsx": "Empty file with no content.",
  "frontend/src/components/admin/employees/EmployeePaymentsPanel.tsx": "Provides UI for manual and scheduled employee payment tracking with tabs, forms for payee/amount/notes, and a note that backend integration is pending.",
  "frontend/src/components/admin/fees/FeeConfigurationPanel.tsx": "Admin panel for configuring marketplace service fees (currently view-only at $5.00 per sale). Includes UI for editing fee amounts with save functionality disabled pending backend integration.",
  "frontend/src/components/admin/financial/FinancialOverviewCards.tsx": "Displays four financial metric cards: available funds, total deposited amounts, credit account status, and deposit method breakdowns. Aggregates data from user transactions and financial state.",
  "frontend/src/components/admin/MarketplaceRoadmapAdmin.tsx": "Admin component displaying marketplace development roadmap with progress tracking, completion status, and refresh functionality. Handles loading, error states, and permission-denied scenarios.",
  "frontend/src/components/admin/messaging/AdminMessagingPanel.tsx": "Placeholder admin messaging panel showing a \"coming soon\" state with planned features like user communication, conversation threads, and message filtering.",
  "frontend/src/components/admin/messaging/MessageComposer.tsx": "Message composition form component with recipient selection, subject, and body fields. Validates input and calls onSend callback with message data.",
  "frontend/src/components/admin/messaging/MessageThread.tsx": "Displays a conversation thread with messages between admin and a user, showing avatars and timestamps. Includes a reply textarea and send functionality.",
  "frontend/src/components/admin/payments/AdminRevenueInflowPanel.tsx": "Admin panel for processing marketplace revenue via Stripe checkout sessions. Handles sale service fees and store builder subscription charges with Stripe configuration checks.",
  "frontend/src/components/admin/payments/OwnerStripeConnectCard.tsx": "Card component for owner Stripe Connect account onboarding (not yet implemented). Shows disconnected status and explains payout functionality pending backend integration.",
  "frontend/src/components/admin/payments/PaymentProcessorsPanel.tsx": "Container panel that groups payment processor configuration cards including StripeSetupCard and OwnerStripeConnectCard under a unified payment processors section.",
  "frontend/src/components/admin/payments/StripeSetupCard.tsx": "Admin card component for configuring Stripe payment processor with secret key and allowed countries, showing configuration status and update form.",
  "frontend/src/components/admin/RoleApplicationsPanel.tsx": "Displays a table of pending role applications with approve/reject actions, using custom hooks to fetch applications and handle approval/rejection mutations with toast notifications.",
  "frontend/src/components/admin/transactions/AdminTransactionsPanel.tsx": "Admin panel displaying all transaction history in a table with filtering, formatting for currency/dates, and status badges for deposits and credit funding transactions.",
  "frontend/src/components/admin/transfers/TransfersStubPanel.tsx": "Stub UI for owner withdrawals with form inputs for amount, currency, and reason; displays alert that backend Stripe payout integration is pending.",
  "frontend/src/components/admin/UserRoleManagement.tsx": "Shows summary cards displaying counts of admins, users, and guests with loading and error states, fetching data via useGetUserRoleSummary hook.",
  "frontend/src/components/assistant/AssistantChatPanel.tsx": "Chat interface for AI assistant with multi-mode support (Customer, Seller, Builder, Operations), voice recognition, text-to-speech, and message history management.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Floating widget button that toggles the assistant chat panel open/closed in the bottom-right corner of the screen.",
  "frontend/src/components/auth/RequireAuthenticatedRegisteredUser.tsx": "Auth guard component that checks for Internet Identity authentication and user profile, redirecting to login or profile setup as needed before rendering children.",
  "frontend/src/components/Footer.tsx": "Footer component displaying four columns with legal/policy links, contact information (EIN, DBA, owner details, support email, phone, address), admin/employee access links, and payment card icons (Visa, Mastercard, Amex, Discover).",
  "frontend/src/components/Layout.tsx": "Main layout component providing sticky header navigation with role-based dropdown menus (Customer, Sellers/Businesses), authentication button, mobile menu sheet, and automatic role-based routing after login using Internet Identity integration.",
  "frontend/src/components/policies/PolicyDocument.tsx": "Empty file for policy document display component.",
  "frontend/src/components/policies/PolicySignaturesPanel.tsx": "Empty file for policy signatures management panel component.",
  "frontend/src/components/policies/RequirePolicySignatures.tsx": "Empty file for policy signature requirement guard component.",
  "frontend/src/components/privacy/CookieConsentBanner.tsx": "Fixed-position banner that prompts users to accept or reject cookies on first visit, storing consent preference and linking to privacy policy.",
  "frontend/src/components/ProfileSetup.tsx": "Dialog component for new users to complete their profile with full name, email, and role selection. Redirects to role-specific dashboards after saving profile via useSaveCallerUserProfile hook.",
  "frontend/src/components/RequireRegisteredUser.tsx": "Higher-order component that checks if authenticated users have a profile and redirects to profile-setup if missing. Shows loading state during profile fetch and allows public access for unauthenticated users.",
  "frontend/src/components/RouterErrorScreen.tsx": "Error screen component for routing failures with options to refresh the page or navigate home. Displays an alert icon and user-friendly error message.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary class component that catches runtime errors and unhandled promise rejections. Displays error details with a refresh button when errors occur.",
  "frontend/src/components/security/HumanCheckDialog.tsx": "A dialog component that implements human verification with a checkbox and simple math challenge (7+3) before allowing payment continuation.",
  "frontend/src/components/seller-onboarding/onboardingSteps.ts": "Defines the configuration for seller onboarding steps including signup, company details, terms, website integration, store setup, and marketing (most marked as placeholders).",
  "frontend/src/components/seller-onboarding/SellerOnboardingWizard.tsx": "A multi-step wizard component for seller onboarding that manages progress through steps, saves state to backend, and displays progress with navigation controls.",
  "frontend/src/components/seller/SellerProfilePlaceholderCard.tsx": "A reusable card component that displays placeholder content with an icon, title, description, and optional \"Coming Soon\" badge.",
  "frontend/src/components/startup/Activities.tsx": "Empty file with no content.",
  "frontend/src/components/startup/BusinessCredit.tsx": "Empty file with no content.",
  "frontend/src/components/startup/ClassesLessons.tsx": "Empty file with no content.",
  "frontend/src/components/startup/LessonDetail.tsx": "Displays detailed lesson content with video embed, HTML content rendering, and completion tracking functionality.",
  "frontend/src/components/startup/VirtualMeetings.tsx": "Empty file with no content.",
  "frontend/src/contexts/VoiceSettingsContext.tsx": "React context provider that combines microphone permission management and voice preferences (activation and spoken replies) into a unified voice settings interface.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages ICP actor creation with authentication, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAssistant.ts": "Provides a mutation hook for asking the AI assistant questions by category, currently returning a placeholder message indicating the feature is under development.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP, providing context and hooks for login, logout, identity management, and authentication status tracking.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Custom hook that manages browser microphone permission state, checking current status and providing methods to request and retry permission.",
  "frontend/src/hooks/usePageActivity.ts": "Custom hook that tracks whether the page is active by monitoring visibility changes, focus, and blur events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend API calls including user profiles, admin checks, role applications, seller onboarding, Stripe configuration, transactions, earnings, and analytics. Includes mutations for initialization, profile saving, and role management with automatic query invalidation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Custom hook that determines the appropriate dashboard redirect path based on the user's active role (seller, customer, business, marketer, employee, admin, or guest).",
  "frontend/src/hooks/useSellerOnboarding.ts": "Provides React Query hooks for fetching and saving seller onboarding progress state with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for voice recognition with support for continuous listening, interim results, error handling, and automatic restart functionality based on microphone permissions.",
  "frontend/src/hooks/useStripeCheckout.ts": "Provides a mutation hook to create Stripe checkout sessions for shopping cart items and redirects the user to the Stripe payment page.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook for text-to-speech functionality using the Web Speech Synthesis API with state management for speaking status and message tracking.",
  "frontend/src/hooks/useVoicePreferences.ts": "Custom hook for managing voice-related user preferences (voice activation and spoken replies) with localStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color tokens for a navy blue theme, menu styling components, animated gradient logo, and voice listening indicator animations.",
  "frontend/src/lib/cookieConsent.ts": "Utility functions for managing cookie consent status in localStorage with get, set, and check operations.",
  "frontend/src/lib/humanCheck.ts": "Manages human verification status in sessionStorage with a 30-minute TTL, providing functions to check, set, and clear verification state.",
  "frontend/src/lib/policies.ts": "Defines policy metadata (privacy, shipping, returns, terms, marketplace) with identifiers, display names, routes, versions, and last updated dates.",
  "frontend/src/lib/pricingCopy.ts": "Centralized pricing copy and constants for marketplace ($5 per sale fee) and optional Store Builder subscription ($10/month) with various display strings for UI.",
  "frontend/src/lib/voice/browserVoice.ts": "Provides feature detection, factory functions, and controller interfaces for Web Speech API (SpeechRecognition and SpeechSynthesis) with browser compatibility checks.",
  "frontend/src/lib/voice/voicePreferences.ts": "Manages voice preferences (voice activation and spoken replies) with localStorage persistence, versioning, and migration support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentity providers wrapping the main App component.",
  "frontend/src/pages/AccountPortalPage.tsx": "Displays authenticated user's account overview with profile information (name, email, creation date, role) and navigation cards for settings, billing, and documentation.",
  "frontend/src/pages/AdminCenterPage.tsx": "Comprehensive admin dashboard with tabs for financial overview, payment processors, fee configuration, transactions, employee payments, user roles, messaging, and access control initialization.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authentication checks, access control initialization, and tabbed interface for financial state, payment processors, fees, transactions, and transfers.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate marketer dashboard showing placeholder cards for referral links, commission tracking, performance analytics, and marketing resources with commission summary.",
  "frontend/src/pages/AppCenterPage.tsx": "App marketplace displaying categorized apps (store builder, marketing, fulfillment, analytics) with availability status badges and color-coded icons.",
  "frontend/src/pages/AppLaunchPage.tsx": "Displays details for a specific app (ClickFunnels, Dropshipping, Template Selector) with launch, configure, and uninstall actions. Includes app status badges and navigation back to the App Center.",
  "frontend/src/pages/ApplyPage.tsx": "Allows authenticated users to apply for Employee or Admin roles by selecting a role card and submitting a reason. Uses useSubmitRoleApplication mutation and displays success/error toasts.",
  "frontend/src/pages/AppointmentDashboard53.tsx": "Empty file with no content.",
  "frontend/src/pages/B2BDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BusinessDashboardPage.tsx": "Displays a B2B business dashboard with four card sections (B2B Services, Business Credit, Team Management, Analytics) and a placeholder business overview section.",
  "frontend/src/pages/CustomerBlog.tsx": "Lists blog posts for customers with categories, read times, and excerpts. Each post card links to a detailed blog post view with navigation support.",
  "frontend/src/pages/CustomerBlogPost.tsx": "Renders individual blog post content based on postId parameter, displaying title, metadata, and full article content with back navigation to the blog list.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a welcome message and four card sections (Purchase History, Wishlist, Messages, Settings) with icons and hover effects, plus a Recent Activity section showing placeholder content.",
  "frontend/src/pages/CustomerFAQ.tsx": "FAQ page for customers with accordion-style questions and answers covering account creation, products, pricing, payments, refunds, support contact info, and Store Builder subscription details.",
  "frontend/src/pages/CustomerFavoritesPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerMessagesPage.tsx": "Customer messages page requiring authentication that displays a placeholder card indicating the messaging system is coming soon with inbox-style (non-real-time) messaging.",
  "frontend/src/pages/CustomerProfileHome.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerPurchaseHistoryPage.tsx": "Purchase history page requiring authentication that displays a placeholder card indicating order tracking and purchase history features are coming soon.",
  "frontend/src/pages/CustomerSettingsPage.tsx": "Customer settings page with voice and microphone permission controls, displaying permission status with icons, and toggles for voice activation and spoken replies features with browser support detection.",
  "frontend/src/pages/CustomerWishlistPage.tsx": "Empty file with no content.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Employee dashboard page displaying a welcome message and four card sections (Assigned Tasks, Schedule, Payroll, Resources) with icons and hover effects, plus a Recent Updates section showing placeholder content.",
  "frontend/src/pages/FunnelsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying ANC Marketplace hero section, three feature cards (E-Commerce, Startup Program, B2B Services), and a pricing section with subscription tiers and a call-to-action to explore services.",
  "frontend/src/pages/MarketplacePolicyPage.tsx": "Static policy page outlining marketplace rules including seller responsibilities, buyer protection, fees ($5 per sale), prohibited items, and dispute resolution contact information.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page within AdminConsoleLayout showing error state with common failure reasons and buttons to return to admin or retry payment.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page within AdminConsoleLayout displaying success state with options to return to admin center or view transactions.",
  "frontend/src/pages/PciCompliancePage.tsx": "PCI DSS compliance certificate display page showing ANC Electronics N More's certificate (number 02202604883801) with preview, download, and view-in-new-tab functionality.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page covering information collection, usage, sharing, data security, user rights, and contact information for privacy inquiries.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Simple wrapper page that renders the ProfileSetup component for user profile configuration.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with role selection (Seller, Customer, Business, Affiliate Marketer) and form for full name/email, integrating Internet Identity authentication and saving user profile with selected role.",
  "frontend/src/pages/ReturnsPolicyPage.tsx": "Static returns policy page detailing 30-day return eligibility, non-returnable items, return process, refund timeline, and shipping cost responsibilities.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays seller earnings dashboard with time-frame filtering (today/week/month/all-time), showing total earnings, orders, products sold, and average order value using cards and formatted currency/numbers.",
  "frontend/src/pages/SellerOnboardingWizardPage.tsx": "Wraps the SellerOnboardingWizard component with RequireAuthenticatedRegisteredUser authentication guard.",
  "frontend/src/pages/SellerPayoutsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerProfilePage.tsx": "Displays placeholder cards for upcoming seller profile features including store branding, account details, dashboard customization, apps/integrations, store settings, and support resources.",
  "frontend/src/pages/SellersBusinessesBlog.tsx": "Displays a grid of blog post cards covering B2B, startup program, store builder, integrations, sales funnels, and business credit topics with navigation to individual posts.",
  "frontend/src/pages/SellersBusinessesBlogPost.tsx": "Renders individual blog post content based on postId parameter, displaying full article text with metadata (date, category, read time) and back navigation.",
  "frontend/src/pages/SellersBusinessesFAQ.tsx": "Displays accordion-style FAQ covering B2B services, subscriptions, startup program, app integrations, store builder, funnels, dropshipping, payments, team management, analytics, and support.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page displaying shipping policy information including methods, costs, processing time, international shipping, and contact details in a card layout.",
  "frontend/src/pages/StartupDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/StoreBuilderPage.tsx": "Empty file with no content.",
  "frontend/src/pages/StorePage.tsx": "Empty file with no content.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Static page displaying terms and conditions covering acceptance, service use, account responsibilities, payments, intellectual property, liability limitations, and contact information.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces and enums for the entire application including user profiles, products, orders, educational content, B2B services, dropshipping partners, app integrations, store builder configuration, and various status/role variant types.",
  "frontend/src/types/speech.d.ts": "TypeScript type definitions for the Web Speech API, declaring SpeechRecognition interfaces and related event types for browser speech recognition functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating the Admin Center is stuck on initialization after Internet Identity authentication was added, with pending feature requests to restore dashboard functionality including account totals, deposit methods, transaction history, and menu navigation."
}