{
  "kind": "build_request",
  "title": "Change app theme color from green to navy blue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the global UI theme so the primary brand color is navy blue (not green) across light and dark modes, including primary/ring/sidebar variables and any custom gradient/outline styles that currently use the green hue.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ok the theme color should be navy blue not green"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/index.css, CSS variables that currently produce a green primary theme (e.g., --primary, --ring, --sidebar-primary and related foreground/accent variables as appropriate) are updated to a navy-blue palette for both :root and .dark.",
        "Any custom CSS using the previous green color (e.g., .logo-text gradient and .company-name-outline stroke/shadow) is updated to match the navy-blue theme.",
        "Primary buttons/links/focus rings and sidebar highlights render in navy blue throughout the app without introducing unreadable contrast in light or dark mode."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update PWA/browser theme metadata colors to match the new navy blue theme color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ok the theme color should be navy blue not green"
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html meta name=\"theme-color\" and msapplication-TileColor are updated from the current blue value to the chosen navy blue hex value.",
        "frontend/public/manifest.json theme_color is updated from the current value to the same navy blue hex value used in index.html.",
        "After the change, the browser UI/PWA theme color reflects navy blue when the app is loaded/installed."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn) or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "No new features, routes, or backend changes.",
    "No changes to logos, icons, or other generated images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}