{
  "kind": "build_request",
  "title": "Add role-based dropdown navigation for all built pages and site-wide Privacy Policy link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the main header navigation (desktop and mobile) so users can access all previously built pages via dropdown menus, with customer pages grouped under a Customer dropdown and seller/business pages grouped under a Sellers & Businesses dropdown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "That is good now how do you access the rest of the pages we built? For the sellers and the customers can you put all the pages in the drop down menu? The sellers and business pagers in their menu and the customers pages in the customers menus?"
        ]
      },
      "acceptanceCriteria": [
        "On desktop, the header navigation contains a “Customer” dropdown that includes links to at least: Store (/store), Customer FAQ (/customer-faq), Customer Blog (/customer-blog).",
        "On desktop, the header navigation contains a “Sellers & Businesses” dropdown that includes links to at least: Store Builder (/store-builder), App Center (/app-center), Funnels (/funnels), Sellers & Businesses FAQ (/sellers-businesses-faq), Sellers & Businesses Blog (/sellers-businesses-blog), Affiliate (/affiliate).",
        "The dropdown navigation is also available from the mobile menu (Sheet) so mobile users can reach the same pages.",
        "Existing navigation elements (top promotional banner, the “Connect with the appointment dashboard53” button, user profile dropdown) continue to work as before.",
        "Links navigate using TanStack Router navigation (no full page reload)."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add a site-wide dropdown menu option in the header navigation that links to the Privacy Policy page (/privacy-policy) and is visible regardless of authentication status and active role.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also there needs to be a menu option in the drop down site wide for the privacy policy."
        ]
      },
      "acceptanceCriteria": [
        "A Privacy Policy navigation item is available in the header as part of a dropdown menu and is visible to unauthenticated and authenticated users.",
        "Clicking the Privacy Policy item routes to /privacy-policy and renders the existing PrivacyPolicyPage.",
        "The existing footer link to Privacy Policy remains intact and continues to work."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify immutable frontend hook entrypoints: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the existing TanStack Router route paths unchanged (e.g., /privacy-policy, /customer-faq, /sellers-businesses-faq, /appointment-dashboard53)."
  ],
  "nonGoals": [
    "Do not add new pages/routes beyond updating navigation access to existing pages.",
    "Do not change authentication/authorization rules for accessing protected pages (e.g., Admin, Startup Dashboard, B2B Dashboard).",
    "Do not implement new backend APIs or change backend state for navigation changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}