{
  "kind": "build_request",
  "title": "Proceed to next phase: make Admin Dashboard fully functional (real backend wiring, owner/admin setup, role management)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an owner/admin bootstrap flow so the first authorized principal can initialize Access Control and set the owner principal from the UI, and ensure subsequent admin-only actions are gated by backend admin permission checks.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When no admin is initialized yet, an authenticated user can complete a one-time initialization flow that calls backend admin bootstrap methods (e.g., initializeAccessControl / setOwnerPrincipal).",
        "After initialization, non-admin callers are rejected by backend admin APIs with an explicit unauthorized error, and the frontend shows a clear access-denied state instead of crashing.",
        "After initialization, the Admin Dashboard loads for admins without manual backend calls from the console."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace placeholder/throwing admin and role-management React Query hooks with real implementations backed by Motoko actor methods, so the Admin Dashboard Users tab works end-to-end (list users, view role summary, and assign roles).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard \u001a Users tab successfully loads a list of users and their roles without showing placeholder errors (e.g., \"User role management not yet available\").",
        "Admins can assign/update a user's access role and/or system role, and the UI reflects the changes after mutation (via query invalidation/refetch).",
        "Non-admin callers cannot list users or assign roles; backend rejects the call and frontend displays a permission error."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Admin Quick Access links open the Admin Dashboard with the correct active tab by reading and syncing the router search param (e.g., /admin?tab=users) with the AdminDashboard tab state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Clicking each Admin Quick Access menu item (Settings/Users/Knowledge Base/Questions/Roadmap) opens /admin and activates the matching tab.",
        "Direct navigation to /admin with a tab search parameter loads the matching tab on first render.",
        "Changing tabs in the Admin Dashboard updates internal state without breaking deep-link behavior."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Confirm Marketplace Roadmap admin section is fully wired: Admin Dashboard loads roadmap data from getAdminDashboardData, and the \"update roadmap\" action (if present in UI) triggers the backend updateMarketplaceRoadmap and refreshes displayed roadmap data.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard Roadmap tab renders roadmap entries using backend-provided AdminDashboardData.",
        "If the UI provides a refresh/update control, it successfully calls updateMarketplaceRoadmap and the roadmap list updates afterward.",
        "Non-admin callers cannot fetch or update roadmap data."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a coherent, distinctive visual theme consistently across the Admin Dashboard experience (colors, typography, spacing, component styling), avoiding a blue/purple-dominant palette, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard, its tabs, and key admin components share a consistent theme (backgrounds, card styling, headings, spacing).",
        "The palette is not predominantly blue/purple (e.g., keep the existing green/teal/earthy accents consistent with current tokens).",
        "All visible UI copy in the modified areas is English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not edit immutable frontend hook/provider bootstrap files: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Implementing the full marketplace (multi-seller catalog, full order lifecycle, real-time messaging).",
    "Adding third-party authentication providers (anything other than Internet Identity).",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}