{
  "kind": "build_request",
  "title": "Improve menu background color and readability",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the header navigation menus to use a white or very light blue background with a professional look, ensuring menu items are clearly readable in both desktop dropdown menus and the mobile slide-over menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The menu needs a white or very light blue background with a professional look that makes the menu items listed readable"
        ]
      },
      "acceptanceCriteria": [
        "Desktop dropdown menus (Customer, Sellers & Businesses, Legal, and authenticated user menu) render on a white or very light blue background and the menu item text is clearly readable.",
        "Mobile menu (SheetContent) renders on a white or very light blue background and all listed links/sections are clearly readable.",
        "Hover/focus states maintain strong contrast and do not reduce readability.",
        "No layout regressions: menu spacing, alignment, and click/tap targets remain functional across desktop and mobile."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources); apply styling via component composition/props/classes in app components such as frontend/src/components/Layout.tsx.",
    "Keep changes limited to menu styling/readability; do not introduce new navigation items or routes."
  ],
  "nonGoals": [
    "Redesigning the entire site theme or changing non-menu page backgrounds.",
    "Adding new menu features (search, personalization, role-based rework) beyond styling/readability fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}