{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Role-based dropdown header navigation + site-wide Privacy Policy menu item",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Replace the current flat header navigation with grouped dropdown menus for Customer vs Sellers & Businesses (desktop + mobile Sheet), without breaking existing header features or route paths.",
      "acceptanceCriteria": [
        "On desktop, the header navigation contains a “Customer” dropdown that includes links to at least: Store (/store), Customer FAQ (/customer-faq), Customer Blog (/customer-blog).",
        "On desktop, the header navigation contains a “Sellers & Businesses” dropdown that includes links to at least: Store Builder (/store-builder), App Center (/app-center), Funnels (/funnels), Sellers & Businesses FAQ (/sellers-businesses-faq), Sellers & Businesses Blog (/sellers-businesses-blog), Affiliate (/affiliate).",
        "The dropdown navigation is also available from the mobile menu (Sheet) so mobile users can reach the same pages.",
        "Existing navigation elements (top promotional banner, the “Connect with the appointment dashboard53” button, user profile dropdown) continue to work as before.",
        "Links navigate using TanStack Router navigation (no full page reload)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Refactor header navigation to use grouped dropdown menus: implement a “Customer” dropdown and a “Sellers & Businesses” dropdown, using the existing shadcn-ui DropdownMenu components (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing. Ensure all items use TanStack Router's navigate({ to: ... }) and keep all existing route paths unchanged. Update the mobile Sheet menu to expose the same grouped navigation (e.g., using the same DropdownMenu patterns or clearly grouped sections within the Sheet) while keeping the promo banner, appointment-dashboard53 button, and user profile dropdown behavior intact."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add a site-wide header dropdown menu item that always links to the existing Privacy Policy page, regardless of auth status or role, without changing the existing footer link.",
      "acceptanceCriteria": [
        "A Privacy Policy navigation item is available in the header as part of a dropdown menu and is visible to unauthenticated and authenticated users.",
        "Clicking the Privacy Policy item routes to /privacy-policy and renders the existing PrivacyPolicyPage.",
        "The existing footer link to Privacy Policy remains intact and continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add a header dropdown (or add a site-wide item within an existing header dropdown) that includes a “Privacy Policy” item wired to navigate({ to: '/privacy-policy' }) and rendered for all users (authenticated or not, any role). Use existing shadcn-ui DropdownMenu components (read-only UI sources); Verify the component's usage instructions before implementing. Do not remove or alter the existing footer Privacy Policy link/button."
        }
      ]
    }
  ]
}