{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve header menu background and readability",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restyle desktop dropdown menus and the mobile slide-over menu to use a white or very light blue background with high-contrast readable text and accessible hover/focus states, without changing navigation structure.",
      "acceptanceCriteria": [
        "Desktop dropdown menus (Customer, Sellers & Businesses, Legal, and authenticated user menu) render on a white or very light blue background and the menu item text is clearly readable.",
        "Mobile menu (SheetContent) renders on a white or very light blue background and all listed links/sections are clearly readable.",
        "Hover/focus states maintain strong contrast and do not reduce readability.",
        "No layout regressions: menu spacing, alignment, and click/tap targets remain functional across desktop and mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the header navigation composition to apply a consistent light menu surface style for: (1) all shadcn-ui DropdownMenuContent instances (Customer, Sellers & Businesses, Legal, authenticated user menu) and (2) the shadcn-ui SheetContent mobile menu. Do this via className/props on Layout-owned components only (do not edit frontend/src/components/ui/*). Ensure dropdown/menu surfaces use white or very light blue background, stronger border/shadow separation, and menu item/link text + focus/hover states maintain high contrast and readability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add small, menu-specific styling helpers (e.g., Tailwind @apply-based utility classes or CSS variables) to standardize the light menu surface background and readable interactive states used by the header dropdowns and mobile menu. Keep changes limited to menu styling/readability and avoid altering non-menu page backgrounds."
        }
      ]
    }
  ]
}