{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update theme from green to navy blue",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace green-based global theme tokens and custom green styles with a navy-blue palette for light and dark modes.",
      "acceptanceCriteria": [
        "In frontend/src/index.css, CSS variables that currently produce a green primary theme (e.g., --primary, --ring, --sidebar-primary and related foreground/accent variables as appropriate) are updated to a navy-blue palette for both :root and .dark.",
        "Any custom CSS using the previous green color (e.g., .logo-text gradient and .company-name-outline stroke/shadow) is updated to match the navy-blue theme.",
        "Primary buttons/links/focus rings and sidebar highlights render in navy blue throughout the app without introducing unreadable contrast in light or dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the global OKLCH theme variables to a navy-blue hue across both :root and .dark (including --primary, --ring, --sidebar-primary, and related background/foreground/secondary/muted/sidebar tokens that currently use the green hue), and replace custom green styles (.logo-text gradient and .company-name-outline stroke/shadow) with navy-blue equivalents while preserving readable contrast."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Align PWA/browser theme metadata colors with the new navy blue brand color.",
      "acceptanceCriteria": [
        "frontend/index.html meta name=\"theme-color\" and msapplication-TileColor are updated from the current blue value to the chosen navy blue hex value.",
        "frontend/public/manifest.json theme_color is updated from the current value to the same navy blue hex value used in index.html.",
        "After the change, the browser UI/PWA theme color reflects navy blue when the app is loaded/installed."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Change the meta theme color metadata to match the chosen navy blue hex value (update both meta name=\"theme-color\" and meta name=\"msapplication-TileColor\" to the same navy color)."
        },
        {
          "path": "frontend/public/manifest.json",
          "operation": "modify",
          "description": "Update manifest.json theme_color to the same navy blue hex value used in frontend/index.html so installed PWA and browser UI reflect navy blue."
        }
      ]
    }
  ]
}