{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Internet Identity registration gate + Profile Setup route and header state",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Add a routable Profile Setup page and enforce a registration gate that redirects authenticated-but-unregistered users to profile setup before accessing authenticated areas.",
      "acceptanceCriteria": [
        "The app has a routable path (e.g., /profile-setup) that renders the existing ProfileSetup component.",
        "When a user logs in and the backend returns no profile, the UI directs the user to the Profile Setup page.",
        "After the profile is successfully saved, the user can navigate to authenticated pages without being redirected back to Profile Setup.",
        "If the user logs out, authenticated-only routes are not accessible and the app returns to public behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileSetupPage.tsx",
          "operation": "create",
          "description": "Create a dedicated page component that renders the existing ProfileSetup component and supports an optional post-setup redirect (e.g., via search param). Use the authorization component’s frontend guidance to check registration state via getCallerUserProfile (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/RequireRegisteredUser.tsx",
          "operation": "create",
          "description": "Add a lightweight route/page guard wrapper that (1) allows public access when not authenticated, (2) redirects authenticated users with a missing profile to /profile-setup (optionally preserving intended destination), and (3) renders children when profile exists. Use the authorization component’s recommended pattern to avoid profile-setup flash by relying on isFetched + userProfile === null (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new /profile-setup route to render ProfileSetupPage, and wire the registration gate by wrapping authenticated routes (at minimum /settings and any other existing authenticated pages wired into the router such as messages/purchase history/wishlist if present) with RequireRegisteredUser so authenticated-but-unregistered users are redirected before seeing protected content."
        },
        {
          "path": "frontend/src/components/ProfileSetup.tsx",
          "operation": "modify",
          "description": "After a successful saveCallerUserProfile mutation, navigate the user away from profile setup (e.g., back to an intended destination or a default authenticated page) so they are not stuck on the setup screen. Keep all user-facing text in English. Use the authorization component’s frontend guidance for profile setup flows (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update the header/user-menu to reflect registration state, providing a clear way to finish profile setup when authenticated but unregistered while preserving current login/logout behavior.",
      "acceptanceCriteria": [
        "When authenticated and profile is missing, the header provides an obvious way to reach the Profile Setup page (link or menu item).",
        "When authenticated and profile exists, the header behaves as it does today (user icon menu with Settings/Admin Center/Logout).",
        "Login/Logout still uses the existing Internet Identity hook and continues clearing React Query cache on logout (as in the current Layout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "In the authenticated header state, query current user profile (via existing React Query hook) and: (1) if authenticated but profile is missing, show an obvious 'Finish Profile Setup' navigation option to /profile-setup; (2) if profile exists, keep current user menu (Settings/Admin Center/Logout) unchanged; (3) keep existing login/logout flow intact including React Query cache clearing. Use the authorization component’s frontend guidance for checking registration state with getCallerUserProfile (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}